garyPenhook/PIC-Assembler/device_includes/pic18f05q20.inc
// Register: OSCTUNE
#define OSCTUNE OSCTUNE
OSCTUNE                                  equ 007Fh
// bitfield definitions
OSCTUNE_TUN_POSN                         equ 0000h
OSCTUNE_TUN_POSITION                     equ 0000h
OSCTUNE_TUN_SIZE                         equ 0006h
OSCTUNE_TUN_LENGTH                       equ 0006h
OSCTUNE_TUN_MASK                         equ 003Fh
OSCTUNE_TUN0_POSN                        equ 0000h
OSCTUNE_TUN0_POSITION                    equ 0000h
OSCTUNE_TUN0_SIZE                        equ 0001h
OSCTUNE_TUN0_LENGTH                      equ 0001h
OSCTUNE_TUN0_MASK                        equ 0001h
OSCTUNE_TUN1_POSN                        equ 0001h
OSCTUNE_TUN1_POSITION                    equ 0001h
OSCTUNE_TUN1_SIZE                        equ 0001h
OSCTUNE_TUN1_LENGTH                      equ 0001h
OSCTUNE_TUN1_MASK                        equ 0002h
OSCTUNE_TUN2_POSN                        equ 0002h
OSCTUNE_TUN2_POSITION                    equ 0002h
OSCTUNE_TUN2_SIZE                        equ 0001h
OSCTUNE_TUN2_LENGTH                      equ 0001h
OSCTUNE_TUN2_MASK                        equ 0004h
OSCTUNE_TUN3_POSN                        equ 0003h
OSCTUNE_TUN3_POSITION                    equ 0003h
OSCTUNE_TUN3_SIZE                        equ 0001h
OSCTUNE_TUN3_LENGTH                      equ 0001h
OSCTUNE_TUN3_MASK                        equ 0008h
OSCTUNE_TUN4_POSN                        equ 0004h
OSCTUNE_TUN4_POSITION                    equ 0004h
OSCTUNE_TUN4_SIZE                        equ 0001h
OSCTUNE_TUN4_LENGTH                      equ 0001h
OSCTUNE_TUN4_MASK                        equ 0010h
OSCTUNE_TUN5_POSN                        equ 0005h
OSCTUNE_TUN5_POSITION                    equ 0005h
OSCTUNE_TUN5_SIZE                        equ 0001h
OSCTUNE_TUN5_LENGTH                      equ 0001h
OSCTUNE_TUN5_MASK                        equ 0020h

// Register: OSCFRQ
#define OSCFRQ OSCFRQ
OSCFRQ                                   equ 0080h
// bitfield definitions
OSCFRQ_FRQ_POSN                          equ 0000h
OSCFRQ_FRQ_POSITION                      equ 0000h
OSCFRQ_FRQ_SIZE                          equ 0004h
OSCFRQ_FRQ_LENGTH                        equ 0004h
OSCFRQ_FRQ_MASK                          equ 000Fh
OSCFRQ_FRQ0_POSN                         equ 0000h
OSCFRQ_FRQ0_POSITION                     equ 0000h
OSCFRQ_FRQ0_SIZE                         equ 0001h
OSCFRQ_FRQ0_LENGTH                       equ 0001h
OSCFRQ_FRQ0_MASK                         equ 0001h
OSCFRQ_FRQ1_POSN                         equ 0001h
OSCFRQ_FRQ1_POSITION                     equ 0001h
OSCFRQ_FRQ1_SIZE                         equ 0001h
OSCFRQ_FRQ1_LENGTH                       equ 0001h
OSCFRQ_FRQ1_MASK                         equ 0002h
OSCFRQ_FRQ2_POSN                         equ 0002h
OSCFRQ_FRQ2_POSITION                     equ 0002h
OSCFRQ_FRQ2_SIZE                         equ 0001h
OSCFRQ_FRQ2_LENGTH                       equ 0001h
OSCFRQ_FRQ2_MASK                         equ 0004h
OSCFRQ_FRQ3_POSN                         equ 0003h
OSCFRQ_FRQ3_POSITION                     equ 0003h
OSCFRQ_FRQ3_SIZE                         equ 0001h
OSCFRQ_FRQ3_LENGTH                       equ 0001h
OSCFRQ_FRQ3_MASK                         equ 0008h

// Register: ACTCON
#define ACTCON ACTCON
ACTCON                                   equ 0081h
// bitfield definitions
ACTCON_ORS_POSN                          equ 0001h
ACTCON_ORS_POSITION                      equ 0001h
ACTCON_ORS_SIZE                          equ 0001h
ACTCON_ORS_LENGTH                        equ 0001h
ACTCON_ORS_MASK                          equ 0002h
ACTCON_LOCK_POSN                         equ 0003h
ACTCON_LOCK_POSITION                     equ 0003h
ACTCON_LOCK_SIZE                         equ 0001h
ACTCON_LOCK_LENGTH                       equ 0001h
ACTCON_LOCK_MASK                         equ 0008h
ACTCON_UD_POSN                           equ 0006h
ACTCON_UD_POSITION                       equ 0006h
ACTCON_UD_SIZE                           equ 0001h
ACTCON_UD_LENGTH                         equ 0001h
ACTCON_UD_MASK                           equ 0040h
ACTCON_EN_POSN                           equ 0007h
ACTCON_EN_POSITION                       equ 0007h
ACTCON_EN_SIZE                           equ 0001h
ACTCON_EN_LENGTH                         equ 0001h
ACTCON_EN_MASK                           equ 0080h
ACTCON_ACTORS_POSN                       equ 0001h
ACTCON_ACTORS_POSITION                   equ 0001h
ACTCON_ACTORS_SIZE                       equ 0001h
ACTCON_ACTORS_LENGTH                     equ 0001h
ACTCON_ACTORS_MASK                       equ 0002h
ACTCON_ACTLOCK_POSN                      equ 0003h
ACTCON_ACTLOCK_POSITION                  equ 0003h
ACTCON_ACTLOCK_SIZE                      equ 0001h
ACTCON_ACTLOCK_LENGTH                    equ 0001h
ACTCON_ACTLOCK_MASK                      equ 0008h
ACTCON_ACTUD_POSN                        equ 0006h
ACTCON_ACTUD_POSITION                    equ 0006h
ACTCON_ACTUD_SIZE                        equ 0001h
ACTCON_ACTUD_LENGTH                      equ 0001h
ACTCON_ACTUD_MASK                        equ 0040h
ACTCON_ACTEN_POSN                        equ 0007h
ACTCON_ACTEN_POSITION                    equ 0007h
ACTCON_ACTEN_SIZE                        equ 0001h
ACTCON_ACTEN_LENGTH                      equ 0001h
ACTCON_ACTEN_MASK                        equ 0080h

// Register: FSCMCON
#define FSCMCON FSCMCON
FSCMCON                                  equ 0082h
// bitfield definitions
FSCMCON_FSCMFEV_POSN                     equ 0000h
FSCMCON_FSCMFEV_POSITION                 equ 0000h
FSCMCON_FSCMFEV_SIZE                     equ 0001h
FSCMCON_FSCMFEV_LENGTH                   equ 0001h
FSCMCON_FSCMFEV_MASK                     equ 0001h
FSCMCON_FSCMFFI_POSN                     equ 0001h
FSCMCON_FSCMFFI_POSITION                 equ 0001h
FSCMCON_FSCMFFI_SIZE                     equ 0001h
FSCMCON_FSCMFFI_LENGTH                   equ 0001h
FSCMCON_FSCMFFI_MASK                     equ 0002h
FSCMCON_FSCMPEV_POSN                     equ 0002h
FSCMCON_FSCMPEV_POSITION                 equ 0002h
FSCMCON_FSCMPEV_SIZE                     equ 0001h
FSCMCON_FSCMPEV_LENGTH                   equ 0001h
FSCMCON_FSCMPEV_MASK                     equ 0004h
FSCMCON_FSCMPFI_POSN                     equ 0003h
FSCMCON_FSCMPFI_POSITION                 equ 0003h
FSCMCON_FSCMPFI_SIZE                     equ 0001h
FSCMCON_FSCMPFI_LENGTH                   equ 0001h
FSCMCON_FSCMPFI_MASK                     equ 0008h
FSCMCON_FSCMSEV_POSN                     equ 0004h
FSCMCON_FSCMSEV_POSITION                 equ 0004h
FSCMCON_FSCMSEV_SIZE                     equ 0001h
FSCMCON_FSCMSEV_LENGTH                   equ 0001h
FSCMCON_FSCMSEV_MASK                     equ 0010h
FSCMCON_FSCMSFI_POSN                     equ 0005h
FSCMCON_FSCMSFI_POSITION                 equ 0005h
FSCMCON_FSCMSFI_SIZE                     equ 0001h
FSCMCON_FSCMSFI_LENGTH                   equ 0001h
FSCMCON_FSCMSFI_MASK                     equ 0020h

