garyPenhook/PIC-Assembler/device_includes/pic18f05q20.inc
// Register: I3C1PIR1
#define I3C1PIR1 I3C1PIR1
I3C1PIR1                                 equ 008Bh
// bitfield definitions
I3C1PIR1_IBIDONEIF_POSN                  equ 0005h
I3C1PIR1_IBIDONEIF_POSITION              equ 0005h
I3C1PIR1_IBIDONEIF_SIZE                  equ 0001h
I3C1PIR1_IBIDONEIF_LENGTH                equ 0001h
I3C1PIR1_IBIDONEIF_MASK                  equ 0020h
I3C1PIR1_DACHIF_POSN                     equ 0006h
I3C1PIR1_DACHIF_POSITION                 equ 0006h
I3C1PIR1_DACHIF_SIZE                     equ 0001h
I3C1PIR1_DACHIF_LENGTH                   equ 0001h
I3C1PIR1_DACHIF_MASK                     equ 0040h
I3C1PIR1_TCOMPIF_POSN                    equ 0007h
I3C1PIR1_TCOMPIF_POSITION                equ 0007h
I3C1PIR1_TCOMPIF_SIZE                    equ 0001h
I3C1PIR1_TCOMPIF_LENGTH                  equ 0001h
I3C1PIR1_TCOMPIF_MASK                    equ 0080h

// Register: I3C1ERRIR0
#define I3C1ERRIR0 I3C1ERRIR0
I3C1ERRIR0                               equ 008Ch
// bitfield definitions
I3C1ERRIR0_UCCCIF_POSN                   equ 0000h
I3C1ERRIR0_UCCCIF_POSITION               equ 0000h
I3C1ERRIR0_UCCCIF_SIZE                   equ 0001h
I3C1ERRIR0_UCCCIF_LENGTH                 equ 0001h
I3C1ERRIR0_UCCCIF_MASK                   equ 0001h
I3C1ERRIR0_BTOIF_POSN                    equ 0001h
I3C1ERRIR0_BTOIF_POSITION                equ 0001h
I3C1ERRIR0_BTOIF_SIZE                    equ 0001h
I3C1ERRIR0_BTOIF_LENGTH                  equ 0001h
I3C1ERRIR0_BTOIF_MASK                    equ 0002h
I3C1ERRIR0_BUSEIF_POSN                   equ 0002h
I3C1ERRIR0_BUSEIF_POSITION               equ 0002h
I3C1ERRIR0_BUSEIF_SIZE                   equ 0001h
I3C1ERRIR0_BUSEIF_LENGTH                 equ 0001h
I3C1ERRIR0_BUSEIF_MASK                   equ 0004h
I3C1ERRIR0_IBIEIF_POSN                   equ 0003h
I3C1ERRIR0_IBIEIF_POSITION               equ 0003h
I3C1ERRIR0_IBIEIF_SIZE                   equ 0001h
I3C1ERRIR0_IBIEIF_LENGTH                 equ 0001h
I3C1ERRIR0_IBIEIF_MASK                   equ 0008h
I3C1ERRIR0_HJEIF_POSN                    equ 0004h
I3C1ERRIR0_HJEIF_POSITION                equ 0004h
I3C1ERRIR0_HJEIF_SIZE                    equ 0001h
I3C1ERRIR0_HJEIF_LENGTH                  equ 0001h
I3C1ERRIR0_HJEIF_MASK                    equ 0010h
I3C1ERRIR0_RXOIF_POSN                    equ 0005h
I3C1ERRIR0_RXOIF_POSITION                equ 0005h
I3C1ERRIR0_RXOIF_SIZE                    equ 0001h
I3C1ERRIR0_RXOIF_LENGTH                  equ 0001h
I3C1ERRIR0_RXOIF_MASK                    equ 0020h
I3C1ERRIR0_TXUIF_POSN                    equ 0006h
I3C1ERRIR0_TXUIF_POSITION                equ 0006h
I3C1ERRIR0_TXUIF_SIZE                    equ 0001h
I3C1ERRIR0_TXUIF_LENGTH                  equ 0001h
I3C1ERRIR0_TXUIF_MASK                    equ 0040h
I3C1ERRIR0_I2CNACKIF_POSN                equ 0007h
I3C1ERRIR0_I2CNACKIF_POSITION            equ 0007h
I3C1ERRIR0_I2CNACKIF_SIZE                equ 0001h
I3C1ERRIR0_I2CNACKIF_LENGTH              equ 0001h
I3C1ERRIR0_I2CNACKIF_MASK                equ 0080h

// Register: I3C1ERRIR1
#define I3C1ERRIR1 I3C1ERRIR1
I3C1ERRIR1                               equ 008Dh
// bitfield definitions
I3C1ERRIR1_RXREIF_POSN                   equ 0000h
I3C1ERRIR1_RXREIF_POSITION               equ 0000h
I3C1ERRIR1_RXREIF_SIZE                   equ 0001h
I3C1ERRIR1_RXREIF_LENGTH                 equ 0001h
I3C1ERRIR1_RXREIF_MASK                   equ 0001h
I3C1ERRIR1_TXWEIF_POSN                   equ 0001h
I3C1ERRIR1_TXWEIF_POSITION               equ 0001h
I3C1ERRIR1_TXWEIF_SIZE                   equ 0001h
I3C1ERRIR1_TXWEIF_LENGTH                 equ 0001h
I3C1ERRIR1_TXWEIF_MASK                   equ 0002h
I3C1ERRIR1_MWLOEIF_POSN                  equ 0002h
I3C1ERRIR1_MWLOEIF_POSITION              equ 0002h
I3C1ERRIR1_MWLOEIF_SIZE                  equ 0001h
I3C1ERRIR1_MWLOEIF_LENGTH                equ 0001h
I3C1ERRIR1_MWLOEIF_MASK                  equ 0004h
I3C1ERRIR1_ABEIF_POSN                    equ 0003h
I3C1ERRIR1_ABEIF_POSITION                equ 0003h
I3C1ERRIR1_ABEIF_SIZE                    equ 0001h
I3C1ERRIR1_ABEIF_LENGTH                  equ 0001h
I3C1ERRIR1_ABEIF_MASK                    equ 0008h

// Register: I3C1PIE0
#define I3C1PIE0 I3C1PIE0
I3C1PIE0                                 equ 008Eh
// bitfield definitions
I3C1PIE0_SCCCIE_POSN                     equ 0000h
I3C1PIE0_SCCCIE_POSITION                 equ 0000h
I3C1PIE0_SCCCIE_SIZE                     equ 0001h
I3C1PIE0_SCCCIE_LENGTH                   equ 0001h
I3C1PIE0_SCCCIE_MASK                     equ 0001h
I3C1PIE0_BTFIE_POSN                      equ 0001h
I3C1PIE0_BTFIE_POSITION                  equ 0001h
I3C1PIE0_BTFIE_SIZE                      equ 0001h
I3C1PIE0_BTFIE_LENGTH                    equ 0001h
I3C1PIE0_BTFIE_MASK                      equ 0002h
I3C1PIE0_DADRIE_POSN                     equ 0002h
I3C1PIE0_DADRIE_POSITION                 equ 0002h
I3C1PIE0_DADRIE_SIZE                     equ 0001h
I3C1PIE0_DADRIE_LENGTH                   equ 0001h
I3C1PIE0_DADRIE_MASK                     equ 0004h
I3C1PIE0_SADRIE_POSN                     equ 0003h
I3C1PIE0_SADRIE_POSITION                 equ 0003h
I3C1PIE0_SADRIE_SIZE                     equ 0001h
I3C1PIE0_SADRIE_LENGTH                   equ 0001h
I3C1PIE0_SADRIE_MASK                     equ 0008h
I3C1PIE0_I2CACKIE_POSN                   equ 0004h
I3C1PIE0_I2CACKIE_POSITION               equ 0004h
I3C1PIE0_I2CACKIE_SIZE                   equ 0001h
I3C1PIE0_I2CACKIE_LENGTH                 equ 0001h
I3C1PIE0_I2CACKIE_MASK                   equ 0010h
I3C1PIE0_RSCIE_POSN                      equ 0005h
I3C1PIE0_RSCIE_POSITION                  equ 0005h
I3C1PIE0_RSCIE_SIZE                      equ 0001h
I3C1PIE0_RSCIE_LENGTH                    equ 0001h
I3C1PIE0_RSCIE_MASK                      equ 0020h
I3C1PIE0_PCIE_POSN                       equ 0006h
I3C1PIE0_PCIE_POSITION                   equ 0006h
I3C1PIE0_PCIE_SIZE                       equ 0001h
I3C1PIE0_PCIE_LENGTH                     equ 0001h
I3C1PIE0_PCIE_MASK                       equ 0040h
I3C1PIE0_SCIE_POSN                       equ 0007h
I3C1PIE0_SCIE_POSITION                   equ 0007h
I3C1PIE0_SCIE_SIZE                       equ 0001h
I3C1PIE0_SCIE_LENGTH                     equ 0001h
I3C1PIE0_SCIE_MASK                       equ 0080h

// Register: I3C1PIE1
#define I3C1PIE1 I3C1PIE1
I3C1PIE1                                 equ 008Fh
// bitfield definitions
I3C1PIE1_IBIDONEIE_POSN                  equ 0005h
I3C1PIE1_IBIDONEIE_POSITION              equ 0005h
I3C1PIE1_IBIDONEIE_SIZE                  equ 0001h
I3C1PIE1_IBIDONEIE_LENGTH                equ 0001h
I3C1PIE1_IBIDONEIE_MASK                  equ 0020h
I3C1PIE1_DACHIE_POSN                     equ 0006h
I3C1PIE1_DACHIE_POSITION                 equ 0006h
I3C1PIE1_DACHIE_SIZE                     equ 0001h
I3C1PIE1_DACHIE_LENGTH                   equ 0001h
I3C1PIE1_DACHIE_MASK                     equ 0040h
I3C1PIE1_TCOMPIE_POSN                    equ 0007h
I3C1PIE1_TCOMPIE_POSITION                equ 0007h
I3C1PIE1_TCOMPIE_SIZE                    equ 0001h
I3C1PIE1_TCOMPIE_LENGTH                  equ 0001h
I3C1PIE1_TCOMPIE_MASK                    equ 0080h

// Register: I3C1ERRIE0
#define I3C1ERRIE0 I3C1ERRIE0
I3C1ERRIE0                               equ 0090h
// bitfield definitions
I3C1ERRIE0_UCCCIE_POSN                   equ 0000h
I3C1ERRIE0_UCCCIE_POSITION               equ 0000h
I3C1ERRIE0_UCCCIE_SIZE                   equ 0001h
I3C1ERRIE0_UCCCIE_LENGTH                 equ 0001h
I3C1ERRIE0_UCCCIE_MASK                   equ 0001h
I3C1ERRIE0_BTOIE_POSN                    equ 0001h
I3C1ERRIE0_BTOIE_POSITION                equ 0001h
I3C1ERRIE0_BTOIE_SIZE                    equ 0001h
I3C1ERRIE0_BTOIE_LENGTH                  equ 0001h
I3C1ERRIE0_BTOIE_MASK                    equ 0002h
I3C1ERRIE0_BUSEIE_POSN                   equ 0002h
I3C1ERRIE0_BUSEIE_POSITION               equ 0002h
I3C1ERRIE0_BUSEIE_SIZE                   equ 0001h
I3C1ERRIE0_BUSEIE_LENGTH                 equ 0001h
I3C1ERRIE0_BUSEIE_MASK                   equ 0004h
I3C1ERRIE0_IBIEIE_POSN                   equ 0003h
I3C1ERRIE0_IBIEIE_POSITION               equ 0003h
I3C1ERRIE0_IBIEIE_SIZE                   equ 0001h
I3C1ERRIE0_IBIEIE_LENGTH                 equ 0001h
I3C1ERRIE0_IBIEIE_MASK                   equ 0008h
I3C1ERRIE0_HJEIE_POSN                    equ 0004h
I3C1ERRIE0_HJEIE_POSITION                equ 0004h
I3C1ERRIE0_HJEIE_SIZE                    equ 0001h
I3C1ERRIE0_HJEIE_LENGTH                  equ 0001h
I3C1ERRIE0_HJEIE_MASK                    equ 0010h
I3C1ERRIE0_RXOIE_POSN                    equ 0005h
I3C1ERRIE0_RXOIE_POSITION                equ 0005h
I3C1ERRIE0_RXOIE_SIZE                    equ 0001h
I3C1ERRIE0_RXOIE_LENGTH                  equ 0001h
I3C1ERRIE0_RXOIE_MASK                    equ 0020h
I3C1ERRIE0_TXUIE_POSN                    equ 0006h
I3C1ERRIE0_TXUIE_POSITION                equ 0006h
I3C1ERRIE0_TXUIE_SIZE                    equ 0001h
I3C1ERRIE0_TXUIE_LENGTH                  equ 0001h
I3C1ERRIE0_TXUIE_MASK                    equ 0040h
I3C1ERRIE0_I2CNACKIE_POSN                equ 0007h
I3C1ERRIE0_I2CNACKIE_POSITION            equ 0007h
I3C1ERRIE0_I2CNACKIE_SIZE                equ 0001h
I3C1ERRIE0_I2CNACKIE_LENGTH              equ 0001h
I3C1ERRIE0_I2CNACKIE_MASK                equ 0080h

// Register: I3C1ERRIE1
#define I3C1ERRIE1 I3C1ERRIE1
I3C1ERRIE1                               equ 0091h
// bitfield definitions
I3C1ERRIE1_RXREIE_POSN                   equ 0000h
I3C1ERRIE1_RXREIE_POSITION               equ 0000h
I3C1ERRIE1_RXREIE_SIZE                   equ 0001h
I3C1ERRIE1_RXREIE_LENGTH                 equ 0001h
I3C1ERRIE1_RXREIE_MASK                   equ 0001h
I3C1ERRIE1_TXWEIE_POSN                   equ 0001h
I3C1ERRIE1_TXWEIE_POSITION               equ 0001h
I3C1ERRIE1_TXWEIE_SIZE                   equ 0001h
I3C1ERRIE1_TXWEIE_LENGTH                 equ 0001h
I3C1ERRIE1_TXWEIE_MASK                   equ 0002h
I3C1ERRIE1_MWLOEIE_POSN                  equ 0002h
I3C1ERRIE1_MWLOEIE_POSITION              equ 0002h
I3C1ERRIE1_MWLOEIE_SIZE                  equ 0001h
I3C1ERRIE1_MWLOEIE_LENGTH                equ 0001h
I3C1ERRIE1_MWLOEIE_MASK                  equ 0004h
I3C1ERRIE1_ABEIE_POSN                    equ 0003h
I3C1ERRIE1_ABEIE_POSITION                equ 0003h
I3C1ERRIE1_ABEIE_SIZE                    equ 0001h
I3C1ERRIE1_ABEIE_LENGTH                  equ 0001h
I3C1ERRIE1_ABEIE_MASK                    equ 0008h

// Register: I3C1BIDL
#define I3C1BIDL I3C1BIDL
I3C1BIDL                                 equ 0092h

// Register: I3C1BIDLL
#define I3C1BIDLL I3C1BIDLL
I3C1BIDLL                                equ 0092h
// bitfield definitions
I3C1BIDLL_BIDLL_POSN                     equ 0000h
I3C1BIDLL_BIDLL_POSITION                 equ 0000h
I3C1BIDLL_BIDLL_SIZE                     equ 0008h
I3C1BIDLL_BIDLL_LENGTH                   equ 0008h
I3C1BIDLL_BIDLL_MASK                     equ 00FFh

