garyPenhook/PIC-Assembler/device_includes/pic18f05q20.inc
// Register: TU16ACON1
#define TU16ACON1 TU16ACON1
TU16ACON1                                equ 012Dh
// bitfield definitions
TU16ACON1_CIF_POSN                       equ 0000h
TU16ACON1_CIF_POSITION                   equ 0000h
TU16ACON1_CIF_SIZE                       equ 0001h
TU16ACON1_CIF_LENGTH                     equ 0001h
TU16ACON1_CIF_MASK                       equ 0001h
TU16ACON1_ZIF_POSN                       equ 0001h
TU16ACON1_ZIF_POSITION                   equ 0001h
TU16ACON1_ZIF_SIZE                       equ 0001h
TU16ACON1_ZIF_LENGTH                     equ 0001h
TU16ACON1_ZIF_MASK                       equ 0002h
TU16ACON1_PRIF_POSN                      equ 0002h
TU16ACON1_PRIF_POSITION                  equ 0002h
TU16ACON1_PRIF_SIZE                      equ 0001h
TU16ACON1_PRIF_LENGTH                    equ 0001h
TU16ACON1_PRIF_MASK                      equ 0004h
TU16ACON1_CAPT_POSN                      equ 0003h
TU16ACON1_CAPT_POSITION                  equ 0003h
TU16ACON1_CAPT_SIZE                      equ 0001h
TU16ACON1_CAPT_LENGTH                    equ 0001h
TU16ACON1_CAPT_MASK                      equ 0008h
TU16ACON1_LIMIT_POSN                     equ 0004h
TU16ACON1_LIMIT_POSITION                 equ 0004h
TU16ACON1_LIMIT_SIZE                     equ 0001h
TU16ACON1_LIMIT_LENGTH                   equ 0001h
TU16ACON1_LIMIT_MASK                     equ 0010h
TU16ACON1_CLR_POSN                       equ 0005h
TU16ACON1_CLR_POSITION                   equ 0005h
TU16ACON1_CLR_SIZE                       equ 0001h
TU16ACON1_CLR_LENGTH                     equ 0001h
TU16ACON1_CLR_MASK                       equ 0020h
TU16ACON1_OSEN_POSN                      equ 0006h
TU16ACON1_OSEN_POSITION                  equ 0006h
TU16ACON1_OSEN_SIZE                      equ 0001h
TU16ACON1_OSEN_LENGTH                    equ 0001h
TU16ACON1_OSEN_MASK                      equ 0040h
TU16ACON1_RUN_POSN                       equ 0007h
TU16ACON1_RUN_POSITION                   equ 0007h
TU16ACON1_RUN_SIZE                       equ 0001h
TU16ACON1_RUN_LENGTH                     equ 0001h
TU16ACON1_RUN_MASK                       equ 0080h
TU16ACON1_TU16ACIF_POSN                  equ 0000h
TU16ACON1_TU16ACIF_POSITION              equ 0000h
TU16ACON1_TU16ACIF_SIZE                  equ 0001h
TU16ACON1_TU16ACIF_LENGTH                equ 0001h
TU16ACON1_TU16ACIF_MASK                  equ 0001h
TU16ACON1_TU16AZIF_POSN                  equ 0001h
TU16ACON1_TU16AZIF_POSITION              equ 0001h
TU16ACON1_TU16AZIF_SIZE                  equ 0001h
TU16ACON1_TU16AZIF_LENGTH                equ 0001h
TU16ACON1_TU16AZIF_MASK                  equ 0002h
TU16ACON1_TU16APRIF_POSN                 equ 0002h
TU16ACON1_TU16APRIF_POSITION             equ 0002h
TU16ACON1_TU16APRIF_SIZE                 equ 0001h
TU16ACON1_TU16APRIF_LENGTH               equ 0001h
TU16ACON1_TU16APRIF_MASK                 equ 0004h
TU16ACON1_TU16ACAPT_POSN                 equ 0003h
TU16ACON1_TU16ACAPT_POSITION             equ 0003h
TU16ACON1_TU16ACAPT_SIZE                 equ 0001h
TU16ACON1_TU16ACAPT_LENGTH               equ 0001h
TU16ACON1_TU16ACAPT_MASK                 equ 0008h
TU16ACON1_TU16ALIMIT_POSN                equ 0004h
TU16ACON1_TU16ALIMIT_POSITION            equ 0004h
TU16ACON1_TU16ALIMIT_SIZE                equ 0001h
TU16ACON1_TU16ALIMIT_LENGTH              equ 0001h
TU16ACON1_TU16ALIMIT_MASK                equ 0010h
TU16ACON1_TU16ACLR_POSN                  equ 0005h
TU16ACON1_TU16ACLR_POSITION              equ 0005h
TU16ACON1_TU16ACLR_SIZE                  equ 0001h
TU16ACON1_TU16ACLR_LENGTH                equ 0001h
TU16ACON1_TU16ACLR_MASK                  equ 0020h
TU16ACON1_TMRAOSEN_POSN                  equ 0006h
TU16ACON1_TMRAOSEN_POSITION              equ 0006h
TU16ACON1_TMRAOSEN_SIZE                  equ 0001h
TU16ACON1_TMRAOSEN_LENGTH                equ 0001h
TU16ACON1_TMRAOSEN_MASK                  equ 0040h
TU16ACON1_TU16ARUN_POSN                  equ 0007h
TU16ACON1_TU16ARUN_POSITION              equ 0007h
TU16ACON1_TU16ARUN_SIZE                  equ 0001h
TU16ACON1_TU16ARUN_LENGTH                equ 0001h
TU16ACON1_TU16ARUN_MASK                  equ 0080h

// Register: TU16AHLT
#define TU16AHLT TU16AHLT
TU16AHLT                                 equ 012Eh
// bitfield definitions
TU16AHLT_STOP_POSN                       equ 0000h
TU16AHLT_STOP_POSITION                   equ 0000h
TU16AHLT_STOP_SIZE                       equ 0002h
TU16AHLT_STOP_LENGTH                     equ 0002h
TU16AHLT_STOP_MASK                       equ 0003h
TU16AHLT_RESET_POSN                      equ 0002h
TU16AHLT_RESET_POSITION                  equ 0002h
TU16AHLT_RESET_SIZE                      equ 0002h
TU16AHLT_RESET_LENGTH                    equ 0002h
TU16AHLT_RESET_MASK                      equ 000Ch
TU16AHLT_START_POSN                      equ 0004h
TU16AHLT_START_POSITION                  equ 0004h
TU16AHLT_START_SIZE                      equ 0002h
TU16AHLT_START_LENGTH                    equ 0002h
TU16AHLT_START_MASK                      equ 0030h
TU16AHLT_CSYNC_POSN                      equ 0006h
TU16AHLT_CSYNC_POSITION                  equ 0006h
TU16AHLT_CSYNC_SIZE                      equ 0001h
TU16AHLT_CSYNC_LENGTH                    equ 0001h
TU16AHLT_CSYNC_MASK                      equ 0040h
TU16AHLT_EPOL_POSN                       equ 0007h
TU16AHLT_EPOL_POSITION                   equ 0007h
TU16AHLT_EPOL_SIZE                       equ 0001h
TU16AHLT_EPOL_LENGTH                     equ 0001h
TU16AHLT_EPOL_MASK                       equ 0080h
TU16AHLT_STOP0_POSN                      equ 0000h
TU16AHLT_STOP0_POSITION                  equ 0000h
TU16AHLT_STOP0_SIZE                      equ 0001h
TU16AHLT_STOP0_LENGTH                    equ 0001h
TU16AHLT_STOP0_MASK                      equ 0001h
TU16AHLT_STOP1_POSN                      equ 0001h
TU16AHLT_STOP1_POSITION                  equ 0001h
TU16AHLT_STOP1_SIZE                      equ 0001h
TU16AHLT_STOP1_LENGTH                    equ 0001h
TU16AHLT_STOP1_MASK                      equ 0002h
TU16AHLT_RESET0_POSN                     equ 0002h
TU16AHLT_RESET0_POSITION                 equ 0002h
TU16AHLT_RESET0_SIZE                     equ 0001h
TU16AHLT_RESET0_LENGTH                   equ 0001h
TU16AHLT_RESET0_MASK                     equ 0004h
TU16AHLT_RESET1_POSN                     equ 0003h
TU16AHLT_RESET1_POSITION                 equ 0003h
TU16AHLT_RESET1_SIZE                     equ 0001h
TU16AHLT_RESET1_LENGTH                   equ 0001h
TU16AHLT_RESET1_MASK                     equ 0008h
TU16AHLT_START0_POSN                     equ 0004h
TU16AHLT_START0_POSITION                 equ 0004h
TU16AHLT_START0_SIZE                     equ 0001h
TU16AHLT_START0_LENGTH                   equ 0001h
TU16AHLT_START0_MASK                     equ 0010h
TU16AHLT_START1_POSN                     equ 0005h
TU16AHLT_START1_POSITION                 equ 0005h
TU16AHLT_START1_SIZE                     equ 0001h
TU16AHLT_START1_LENGTH                   equ 0001h
TU16AHLT_START1_MASK                     equ 0020h
TU16AHLT_TU16ASTOP_POSN                  equ 0000h
TU16AHLT_TU16ASTOP_POSITION              equ 0000h
TU16AHLT_TU16ASTOP_SIZE                  equ 0002h
TU16AHLT_TU16ASTOP_LENGTH                equ 0002h
TU16AHLT_TU16ASTOP_MASK                  equ 0003h
TU16AHLT_TU16ARESET_POSN                 equ 0002h
TU16AHLT_TU16ARESET_POSITION             equ 0002h
TU16AHLT_TU16ARESET_SIZE                 equ 0002h
TU16AHLT_TU16ARESET_LENGTH               equ 0002h
TU16AHLT_TU16ARESET_MASK                 equ 000Ch
TU16AHLT_TU16ASTART_POSN                 equ 0004h
TU16AHLT_TU16ASTART_POSITION             equ 0004h
TU16AHLT_TU16ASTART_SIZE                 equ 0002h
TU16AHLT_TU16ASTART_LENGTH               equ 0002h
TU16AHLT_TU16ASTART_MASK                 equ 0030h
TU16AHLT_TU16ACSYNC_POSN                 equ 0006h
TU16AHLT_TU16ACSYNC_POSITION             equ 0006h
TU16AHLT_TU16ACSYNC_SIZE                 equ 0001h
TU16AHLT_TU16ACSYNC_LENGTH               equ 0001h
TU16AHLT_TU16ACSYNC_MASK                 equ 0040h
TU16AHLT_TU16AEPOL_POSN                  equ 0007h
TU16AHLT_TU16AEPOL_POSITION              equ 0007h
TU16AHLT_TU16AEPOL_SIZE                  equ 0001h
TU16AHLT_TU16AEPOL_LENGTH                equ 0001h
TU16AHLT_TU16AEPOL_MASK                  equ 0080h
TU16AHLT_TU16ASTOP0_POSN                 equ 0000h
TU16AHLT_TU16ASTOP0_POSITION             equ 0000h
TU16AHLT_TU16ASTOP0_SIZE                 equ 0001h
TU16AHLT_TU16ASTOP0_LENGTH               equ 0001h
TU16AHLT_TU16ASTOP0_MASK                 equ 0001h
TU16AHLT_TU16ASTOP1_POSN                 equ 0001h
TU16AHLT_TU16ASTOP1_POSITION             equ 0001h
TU16AHLT_TU16ASTOP1_SIZE                 equ 0001h
TU16AHLT_TU16ASTOP1_LENGTH               equ 0001h
TU16AHLT_TU16ASTOP1_MASK                 equ 0002h
TU16AHLT_TU16ARESET0_POSN                equ 0002h
TU16AHLT_TU16ARESET0_POSITION            equ 0002h
TU16AHLT_TU16ARESET0_SIZE                equ 0001h
TU16AHLT_TU16ARESET0_LENGTH              equ 0001h
TU16AHLT_TU16ARESET0_MASK                equ 0004h
TU16AHLT_TU16ARESET1_POSN                equ 0003h
TU16AHLT_TU16ARESET1_POSITION            equ 0003h
TU16AHLT_TU16ARESET1_SIZE                equ 0001h
TU16AHLT_TU16ARESET1_LENGTH              equ 0001h
TU16AHLT_TU16ARESET1_MASK                equ 0008h
TU16AHLT_TU16ASTART0_POSN                equ 0004h
TU16AHLT_TU16ASTART0_POSITION            equ 0004h
TU16AHLT_TU16ASTART0_SIZE                equ 0001h
TU16AHLT_TU16ASTART0_LENGTH              equ 0001h
TU16AHLT_TU16ASTART0_MASK                equ 0010h
TU16AHLT_TU16ASTART1_POSN                equ 0005h
TU16AHLT_TU16ASTART1_POSITION            equ 0005h
TU16AHLT_TU16ASTART1_SIZE                equ 0001h
TU16AHLT_TU16ASTART1_LENGTH              equ 0001h
TU16AHLT_TU16ASTART1_MASK                equ 0020h

