garyPenhook/PIC-Assembler/device_includes/pic18f05q20.inc
// Register: TU16BCLK
#define TU16BCLK TU16BCLK
TU16BCLK                                 equ 0146h
// bitfield definitions
TU16BCLK_CLK_POSN                        equ 0000h
TU16BCLK_CLK_POSITION                    equ 0000h
TU16BCLK_CLK_SIZE                        equ 0008h
TU16BCLK_CLK_LENGTH                      equ 0008h
TU16BCLK_CLK_MASK                        equ 00FFh
TU16BCLK_CLK0_POSN                       equ 0000h
TU16BCLK_CLK0_POSITION                   equ 0000h
TU16BCLK_CLK0_SIZE                       equ 0001h
TU16BCLK_CLK0_LENGTH                     equ 0001h
TU16BCLK_CLK0_MASK                       equ 0001h
TU16BCLK_CLK1_POSN                       equ 0001h
TU16BCLK_CLK1_POSITION                   equ 0001h
TU16BCLK_CLK1_SIZE                       equ 0001h
TU16BCLK_CLK1_LENGTH                     equ 0001h
TU16BCLK_CLK1_MASK                       equ 0002h
TU16BCLK_CLK2_POSN                       equ 0002h
TU16BCLK_CLK2_POSITION                   equ 0002h
TU16BCLK_CLK2_SIZE                       equ 0001h
TU16BCLK_CLK2_LENGTH                     equ 0001h
TU16BCLK_CLK2_MASK                       equ 0004h
TU16BCLK_CLK3_POSN                       equ 0003h
TU16BCLK_CLK3_POSITION                   equ 0003h
TU16BCLK_CLK3_SIZE                       equ 0001h
TU16BCLK_CLK3_LENGTH                     equ 0001h
TU16BCLK_CLK3_MASK                       equ 0008h
TU16BCLK_CLK4_POSN                       equ 0004h
TU16BCLK_CLK4_POSITION                   equ 0004h
TU16BCLK_CLK4_SIZE                       equ 0001h
TU16BCLK_CLK4_LENGTH                     equ 0001h
TU16BCLK_CLK4_MASK                       equ 0010h
TU16BCLK_TU16BCLK0_POSN                  equ 0000h
TU16BCLK_TU16BCLK0_POSITION              equ 0000h
TU16BCLK_TU16BCLK0_SIZE                  equ 0001h
TU16BCLK_TU16BCLK0_LENGTH                equ 0001h
TU16BCLK_TU16BCLK0_MASK                  equ 0001h
TU16BCLK_TU16BCLK1_POSN                  equ 0001h
TU16BCLK_TU16BCLK1_POSITION              equ 0001h
TU16BCLK_TU16BCLK1_SIZE                  equ 0001h
TU16BCLK_TU16BCLK1_LENGTH                equ 0001h
TU16BCLK_TU16BCLK1_MASK                  equ 0002h
TU16BCLK_TU16BCLK2_POSN                  equ 0002h
TU16BCLK_TU16BCLK2_POSITION              equ 0002h
TU16BCLK_TU16BCLK2_SIZE                  equ 0001h
TU16BCLK_TU16BCLK2_LENGTH                equ 0001h
TU16BCLK_TU16BCLK2_MASK                  equ 0004h
TU16BCLK_TU16BCLK3_POSN                  equ 0003h
TU16BCLK_TU16BCLK3_POSITION              equ 0003h
TU16BCLK_TU16BCLK3_SIZE                  equ 0001h
TU16BCLK_TU16BCLK3_LENGTH                equ 0001h
TU16BCLK_TU16BCLK3_MASK                  equ 0008h
TU16BCLK_TU16BCLK4_POSN                  equ 0004h
TU16BCLK_TU16BCLK4_POSITION              equ 0004h
TU16BCLK_TU16BCLK4_SIZE                  equ 0001h
TU16BCLK_TU16BCLK4_LENGTH                equ 0001h
TU16BCLK_TU16BCLK4_MASK                  equ 0010h

// Register: TU16BERS
#define TU16BERS TU16BERS
TU16BERS                                 equ 0147h
// bitfield definitions
TU16BERS_ERS_POSN                        equ 0000h
TU16BERS_ERS_POSITION                    equ 0000h
TU16BERS_ERS_SIZE                        equ 0008h
TU16BERS_ERS_LENGTH                      equ 0008h
TU16BERS_ERS_MASK                        equ 00FFh
TU16BERS_ERS0_POSN                       equ 0000h
TU16BERS_ERS0_POSITION                   equ 0000h
TU16BERS_ERS0_SIZE                       equ 0001h
TU16BERS_ERS0_LENGTH                     equ 0001h
TU16BERS_ERS0_MASK                       equ 0001h
TU16BERS_ERS1_POSN                       equ 0001h
TU16BERS_ERS1_POSITION                   equ 0001h
TU16BERS_ERS1_SIZE                       equ 0001h
TU16BERS_ERS1_LENGTH                     equ 0001h
TU16BERS_ERS1_MASK                       equ 0002h
TU16BERS_ERS2_POSN                       equ 0002h
TU16BERS_ERS2_POSITION                   equ 0002h
TU16BERS_ERS2_SIZE                       equ 0001h
TU16BERS_ERS2_LENGTH                     equ 0001h
TU16BERS_ERS2_MASK                       equ 0004h
TU16BERS_ERS3_POSN                       equ 0003h
TU16BERS_ERS3_POSITION                   equ 0003h
TU16BERS_ERS3_SIZE                       equ 0001h
TU16BERS_ERS3_LENGTH                     equ 0001h
TU16BERS_ERS3_MASK                       equ 0008h
TU16BERS_ERS4_POSN                       equ 0004h
TU16BERS_ERS4_POSITION                   equ 0004h
TU16BERS_ERS4_SIZE                       equ 0001h
TU16BERS_ERS4_LENGTH                     equ 0001h
TU16BERS_ERS4_MASK                       equ 0010h
TU16BERS_ERS5_POSN                       equ 0005h
TU16BERS_ERS5_POSITION                   equ 0005h
TU16BERS_ERS5_SIZE                       equ 0001h
TU16BERS_ERS5_LENGTH                     equ 0001h
TU16BERS_ERS5_MASK                       equ 0020h
TU16BERS_TU16BERS0_POSN                  equ 0000h
TU16BERS_TU16BERS0_POSITION              equ 0000h
TU16BERS_TU16BERS0_SIZE                  equ 0001h
TU16BERS_TU16BERS0_LENGTH                equ 0001h
TU16BERS_TU16BERS0_MASK                  equ 0001h
TU16BERS_TU16BERS1_POSN                  equ 0001h
TU16BERS_TU16BERS1_POSITION              equ 0001h
TU16BERS_TU16BERS1_SIZE                  equ 0001h
TU16BERS_TU16BERS1_LENGTH                equ 0001h
TU16BERS_TU16BERS1_MASK                  equ 0002h
TU16BERS_TU16BERS2_POSN                  equ 0002h
TU16BERS_TU16BERS2_POSITION              equ 0002h
TU16BERS_TU16BERS2_SIZE                  equ 0001h
TU16BERS_TU16BERS2_LENGTH                equ 0001h
TU16BERS_TU16BERS2_MASK                  equ 0004h
TU16BERS_TU16BERS3_POSN                  equ 0003h
TU16BERS_TU16BERS3_POSITION              equ 0003h
TU16BERS_TU16BERS3_SIZE                  equ 0001h
TU16BERS_TU16BERS3_LENGTH                equ 0001h
TU16BERS_TU16BERS3_MASK                  equ 0008h
TU16BERS_TU16BERS4_POSN                  equ 0004h
TU16BERS_TU16BERS4_POSITION              equ 0004h
TU16BERS_TU16BERS4_SIZE                  equ 0001h
TU16BERS_TU16BERS4_LENGTH                equ 0001h
TU16BERS_TU16BERS4_MASK                  equ 0010h
TU16BERS_TU16BERS5_POSN                  equ 0005h
TU16BERS_TU16BERS5_POSITION              equ 0005h
TU16BERS_TU16BERS5_SIZE                  equ 0001h
TU16BERS_TU16BERS5_LENGTH                equ 0001h
TU16BERS_TU16BERS5_MASK                  equ 0020h

// Register: CCPTMRS0
#define CCPTMRS0 CCPTMRS0
CCPTMRS0                                 equ 0148h
// bitfield definitions
CCPTMRS0_C1TSEL_POSN                     equ 0000h
CCPTMRS0_C1TSEL_POSITION                 equ 0000h
CCPTMRS0_C1TSEL_SIZE                     equ 0002h
CCPTMRS0_C1TSEL_LENGTH                   equ 0002h
CCPTMRS0_C1TSEL_MASK                     equ 0003h
CCPTMRS0_C2TSEL_POSN                     equ 0002h
CCPTMRS0_C2TSEL_POSITION                 equ 0002h
CCPTMRS0_C2TSEL_SIZE                     equ 0002h
CCPTMRS0_C2TSEL_LENGTH                   equ 0002h
CCPTMRS0_C2TSEL_MASK                     equ 000Ch
CCPTMRS0_C1TSEL0_POSN                    equ 0000h
CCPTMRS0_C1TSEL0_POSITION                equ 0000h
CCPTMRS0_C1TSEL0_SIZE                    equ 0001h
CCPTMRS0_C1TSEL0_LENGTH                  equ 0001h
CCPTMRS0_C1TSEL0_MASK                    equ 0001h
CCPTMRS0_C1TSEL1_POSN                    equ 0001h
CCPTMRS0_C1TSEL1_POSITION                equ 0001h
CCPTMRS0_C1TSEL1_SIZE                    equ 0001h
CCPTMRS0_C1TSEL1_LENGTH                  equ 0001h
CCPTMRS0_C1TSEL1_MASK                    equ 0002h
CCPTMRS0_C2TSEL2_POSN                    equ 0002h
CCPTMRS0_C2TSEL2_POSITION                equ 0002h
CCPTMRS0_C2TSEL2_SIZE                    equ 0001h
CCPTMRS0_C2TSEL2_LENGTH                  equ 0001h
CCPTMRS0_C2TSEL2_MASK                    equ 0004h
CCPTMRS0_C2TSEL3_POSN                    equ 0003h
CCPTMRS0_C2TSEL3_POSITION                equ 0003h
CCPTMRS0_C2TSEL3_SIZE                    equ 0001h
CCPTMRS0_C2TSEL3_LENGTH                  equ 0001h
CCPTMRS0_C2TSEL3_MASK                    equ 0008h

// Register: CCPR1
#define CCPR1 CCPR1
CCPR1                                    equ 0149h

// Register: CCPR1L
#define CCPR1L CCPR1L
CCPR1L                                   equ 0149h
// bitfield definitions
CCPR1L_RL_POSN                           equ 0000h
CCPR1L_RL_POSITION                       equ 0000h
CCPR1L_RL_SIZE                           equ 0008h
CCPR1L_RL_LENGTH                         equ 0008h
CCPR1L_RL_MASK                           equ 00FFh

// Register: CCPR1H
#define CCPR1H CCPR1H
CCPR1H                                   equ 014Ah
// bitfield definitions
CCPR1H_RH_POSN                           equ 0000h
CCPR1H_RH_POSITION                       equ 0000h
CCPR1H_RH_SIZE                           equ 0008h
CCPR1H_RH_LENGTH                         equ 0008h
CCPR1H_RH_MASK                           equ 00FFh

// Register: CCP1CON
#define CCP1CON CCP1CON
CCP1CON                                  equ 014Bh
// bitfield definitions
CCP1CON_MODE_POSN                        equ 0000h
CCP1CON_MODE_POSITION                    equ 0000h
CCP1CON_MODE_SIZE                        equ 0004h
CCP1CON_MODE_LENGTH                      equ 0004h
CCP1CON_MODE_MASK                        equ 000Fh
CCP1CON_FMT_POSN                         equ 0004h
CCP1CON_FMT_POSITION                     equ 0004h
CCP1CON_FMT_SIZE                         equ 0001h
CCP1CON_FMT_LENGTH                       equ 0001h
CCP1CON_FMT_MASK                         equ 0010h
CCP1CON_OUT_POSN                         equ 0005h
CCP1CON_OUT_POSITION                     equ 0005h
CCP1CON_OUT_SIZE                         equ 0001h
CCP1CON_OUT_LENGTH                       equ 0001h
CCP1CON_OUT_MASK                         equ 0020h
CCP1CON_EN_POSN                          equ 0007h
CCP1CON_EN_POSITION                      equ 0007h
CCP1CON_EN_SIZE                          equ 0001h
CCP1CON_EN_LENGTH                        equ 0001h
CCP1CON_EN_MASK                          equ 0080h
CCP1CON_MODE0_POSN                       equ 0000h
CCP1CON_MODE0_POSITION                   equ 0000h
CCP1CON_MODE0_SIZE                       equ 0001h
CCP1CON_MODE0_LENGTH                     equ 0001h
CCP1CON_MODE0_MASK                       equ 0001h
CCP1CON_MODE1_POSN                       equ 0001h
CCP1CON_MODE1_POSITION                   equ 0001h
CCP1CON_MODE1_SIZE                       equ 0001h
CCP1CON_MODE1_LENGTH                     equ 0001h
CCP1CON_MODE1_MASK                       equ 0002h
CCP1CON_MODE2_POSN                       equ 0002h
CCP1CON_MODE2_POSITION                   equ 0002h
CCP1CON_MODE2_SIZE                       equ 0001h
CCP1CON_MODE2_LENGTH                     equ 0001h
CCP1CON_MODE2_MASK                       equ 0004h
CCP1CON_MODE3_POSN                       equ 0003h
CCP1CON_MODE3_POSITION                   equ 0003h
CCP1CON_MODE3_SIZE                       equ 0001h
CCP1CON_MODE3_LENGTH                     equ 0001h
CCP1CON_MODE3_MASK                       equ 0008h
CCP1CON_CCP1MODE_POSN                    equ 0000h
CCP1CON_CCP1MODE_POSITION                equ 0000h
CCP1CON_CCP1MODE_SIZE                    equ 0004h
CCP1CON_CCP1MODE_LENGTH                  equ 0004h
CCP1CON_CCP1MODE_MASK                    equ 000Fh
CCP1CON_CCP1FMT_POSN                     equ 0004h
CCP1CON_CCP1FMT_POSITION                 equ 0004h
CCP1CON_CCP1FMT_SIZE                     equ 0001h
CCP1CON_CCP1FMT_LENGTH                   equ 0001h
CCP1CON_CCP1FMT_MASK                     equ 0010h
CCP1CON_CCP1OUT_POSN                     equ 0005h
CCP1CON_CCP1OUT_POSITION                 equ 0005h
CCP1CON_CCP1OUT_SIZE                     equ 0001h
CCP1CON_CCP1OUT_LENGTH                   equ 0001h
CCP1CON_CCP1OUT_MASK                     equ 0020h
CCP1CON_CCP1EN_POSN                      equ 0007h
CCP1CON_CCP1EN_POSITION                  equ 0007h
CCP1CON_CCP1EN_SIZE                      equ 0001h
CCP1CON_CCP1EN_LENGTH                    equ 0001h
CCP1CON_CCP1EN_MASK                      equ 0080h
CCP1CON_CCP1MODE0_POSN                   equ 0000h
CCP1CON_CCP1MODE0_POSITION               equ 0000h
CCP1CON_CCP1MODE0_SIZE                   equ 0001h
CCP1CON_CCP1MODE0_LENGTH                 equ 0001h
CCP1CON_CCP1MODE0_MASK                   equ 0001h
CCP1CON_CCP1MODE1_POSN                   equ 0001h
CCP1CON_CCP1MODE1_POSITION               equ 0001h
CCP1CON_CCP1MODE1_SIZE                   equ 0001h
CCP1CON_CCP1MODE1_LENGTH                 equ 0001h
CCP1CON_CCP1MODE1_MASK                   equ 0002h
CCP1CON_CCP1MODE2_POSN                   equ 0002h
CCP1CON_CCP1MODE2_POSITION               equ 0002h
CCP1CON_CCP1MODE2_SIZE                   equ 0001h
CCP1CON_CCP1MODE2_LENGTH                 equ 0001h
CCP1CON_CCP1MODE2_MASK                   equ 0004h
CCP1CON_CCP1MODE3_POSN                   equ 0003h
CCP1CON_CCP1MODE3_POSITION               equ 0003h
CCP1CON_CCP1MODE3_SIZE                   equ 0001h
CCP1CON_CCP1MODE3_LENGTH                 equ 0001h
CCP1CON_CCP1MODE3_MASK                   equ 0008h

// Register: CCP1CAP
#define CCP1CAP CCP1CAP
CCP1CAP                                  equ 014Ch
// bitfield definitions
CCP1CAP_CTS_POSN                         equ 0000h
CCP1CAP_CTS_POSITION                     equ 0000h
CCP1CAP_CTS_SIZE                         equ 0008h
CCP1CAP_CTS_LENGTH                       equ 0008h
CCP1CAP_CTS_MASK                         equ 00FFh
CCP1CAP_CTS0_POSN                        equ 0000h
CCP1CAP_CTS0_POSITION                    equ 0000h
CCP1CAP_CTS0_SIZE                        equ 0001h
CCP1CAP_CTS0_LENGTH                      equ 0001h
CCP1CAP_CTS0_MASK                        equ 0001h
CCP1CAP_CTS1_POSN                        equ 0001h
CCP1CAP_CTS1_POSITION                    equ 0001h
CCP1CAP_CTS1_SIZE                        equ 0001h
CCP1CAP_CTS1_LENGTH                      equ 0001h
CCP1CAP_CTS1_MASK                        equ 0002h
CCP1CAP_CTS2_POSN                        equ 0002h
CCP1CAP_CTS2_POSITION                    equ 0002h
CCP1CAP_CTS2_SIZE                        equ 0001h
CCP1CAP_CTS2_LENGTH                      equ 0001h
CCP1CAP_CTS2_MASK                        equ 0004h
CCP1CAP_CCP1CTS_POSN                     equ 0000h
CCP1CAP_CCP1CTS_POSITION                 equ 0000h
CCP1CAP_CCP1CTS_SIZE                     equ 0008h
CCP1CAP_CCP1CTS_LENGTH                   equ 0008h
CCP1CAP_CCP1CTS_MASK                     equ 00FFh
CCP1CAP_CCP1CTS0_POSN                    equ 0000h
CCP1CAP_CCP1CTS0_POSITION                equ 0000h
CCP1CAP_CCP1CTS0_SIZE                    equ 0001h
CCP1CAP_CCP1CTS0_LENGTH                  equ 0001h
CCP1CAP_CCP1CTS0_MASK                    equ 0001h
CCP1CAP_CCP1CTS1_POSN                    equ 0001h
CCP1CAP_CCP1CTS1_POSITION                equ 0001h
CCP1CAP_CCP1CTS1_SIZE                    equ 0001h
CCP1CAP_CCP1CTS1_LENGTH                  equ 0001h
CCP1CAP_CCP1CTS1_MASK                    equ 0002h
CCP1CAP_CCP1CTS2_POSN                    equ 0002h
CCP1CAP_CCP1CTS2_POSITION                equ 0002h
CCP1CAP_CCP1CTS2_SIZE                    equ 0001h
CCP1CAP_CCP1CTS2_LENGTH                  equ 0001h
CCP1CAP_CCP1CTS2_MASK                    equ 0004h

// Register: CCPR2
#define CCPR2 CCPR2
CCPR2                                    equ 014Dh

// Register: CCPR2L
#define CCPR2L CCPR2L
CCPR2L                                   equ 014Dh
// bitfield definitions
CCPR2L_RL_POSN                           equ 0000h
CCPR2L_RL_POSITION                       equ 0000h
CCPR2L_RL_SIZE                           equ 0008h
CCPR2L_RL_LENGTH                         equ 0008h
CCPR2L_RL_MASK                           equ 00FFh

