garyPenhook/PIC-Assembler/device_includes/pic18f05q20.inc
// Register: T2INPPS
#define T2INPPS T2INPPS
T2INPPS                                  equ 0360h
// bitfield definitions
T2INPPS_T2INPPS_POSN                     equ 0000h
T2INPPS_T2INPPS_POSITION                 equ 0000h
T2INPPS_T2INPPS_SIZE                     equ 0005h
T2INPPS_T2INPPS_LENGTH                   equ 0005h
T2INPPS_T2INPPS_MASK                     equ 001Fh
T2INPPS_T2INPPS0_POSN                    equ 0000h
T2INPPS_T2INPPS0_POSITION                equ 0000h
T2INPPS_T2INPPS0_SIZE                    equ 0001h
T2INPPS_T2INPPS0_LENGTH                  equ 0001h
T2INPPS_T2INPPS0_MASK                    equ 0001h
T2INPPS_T2INPPS1_POSN                    equ 0001h
T2INPPS_T2INPPS1_POSITION                equ 0001h
T2INPPS_T2INPPS1_SIZE                    equ 0001h
T2INPPS_T2INPPS1_LENGTH                  equ 0001h
T2INPPS_T2INPPS1_MASK                    equ 0002h
T2INPPS_T2INPPS2_POSN                    equ 0002h
T2INPPS_T2INPPS2_POSITION                equ 0002h
T2INPPS_T2INPPS2_SIZE                    equ 0001h
T2INPPS_T2INPPS2_LENGTH                  equ 0001h
T2INPPS_T2INPPS2_MASK                    equ 0004h
T2INPPS_T2INPPS3_POSN                    equ 0003h
T2INPPS_T2INPPS3_POSITION                equ 0003h
T2INPPS_T2INPPS3_SIZE                    equ 0001h
T2INPPS_T2INPPS3_LENGTH                  equ 0001h
T2INPPS_T2INPPS3_MASK                    equ 0008h
T2INPPS_T2INPPS4_POSN                    equ 0004h
T2INPPS_T2INPPS4_POSITION                equ 0004h
T2INPPS_T2INPPS4_SIZE                    equ 0001h
T2INPPS_T2INPPS4_LENGTH                  equ 0001h
T2INPPS_T2INPPS4_MASK                    equ 0010h

// Register: T4INPPS
#define T4INPPS T4INPPS
T4INPPS                                  equ 0361h
// bitfield definitions
T4INPPS_T4INPPS_POSN                     equ 0000h
T4INPPS_T4INPPS_POSITION                 equ 0000h
T4INPPS_T4INPPS_SIZE                     equ 0005h
T4INPPS_T4INPPS_LENGTH                   equ 0005h
T4INPPS_T4INPPS_MASK                     equ 001Fh
T4INPPS_T4INPPS0_POSN                    equ 0000h
T4INPPS_T4INPPS0_POSITION                equ 0000h
T4INPPS_T4INPPS0_SIZE                    equ 0001h
T4INPPS_T4INPPS0_LENGTH                  equ 0001h
T4INPPS_T4INPPS0_MASK                    equ 0001h
T4INPPS_T4INPPS1_POSN                    equ 0001h
T4INPPS_T4INPPS1_POSITION                equ 0001h
T4INPPS_T4INPPS1_SIZE                    equ 0001h
T4INPPS_T4INPPS1_LENGTH                  equ 0001h
T4INPPS_T4INPPS1_MASK                    equ 0002h
T4INPPS_T4INPPS2_POSN                    equ 0002h
T4INPPS_T4INPPS2_POSITION                equ 0002h
T4INPPS_T4INPPS2_SIZE                    equ 0001h
T4INPPS_T4INPPS2_LENGTH                  equ 0001h
T4INPPS_T4INPPS2_MASK                    equ 0004h
T4INPPS_T4INPPS3_POSN                    equ 0003h
T4INPPS_T4INPPS3_POSITION                equ 0003h
T4INPPS_T4INPPS3_SIZE                    equ 0001h
T4INPPS_T4INPPS3_LENGTH                  equ 0001h
T4INPPS_T4INPPS3_MASK                    equ 0008h
T4INPPS_T4INPPS4_POSN                    equ 0004h
T4INPPS_T4INPPS4_POSITION                equ 0004h
T4INPPS_T4INPPS4_SIZE                    equ 0001h
T4INPPS_T4INPPS4_LENGTH                  equ 0001h
T4INPPS_T4INPPS4_MASK                    equ 0010h

// Register: TUIN0PPS
#define TUIN0PPS TUIN0PPS
TUIN0PPS                                 equ 0365h
// bitfield definitions
TUIN0PPS_TUIN0PPS_POSN                   equ 0000h
TUIN0PPS_TUIN0PPS_POSITION               equ 0000h
TUIN0PPS_TUIN0PPS_SIZE                   equ 0005h
TUIN0PPS_TUIN0PPS_LENGTH                 equ 0005h
TUIN0PPS_TUIN0PPS_MASK                   equ 001Fh
TUIN0PPS_TUIN0PPS0_POSN                  equ 0000h
TUIN0PPS_TUIN0PPS0_POSITION              equ 0000h
TUIN0PPS_TUIN0PPS0_SIZE                  equ 0001h
TUIN0PPS_TUIN0PPS0_LENGTH                equ 0001h
TUIN0PPS_TUIN0PPS0_MASK                  equ 0001h
TUIN0PPS_TUIN0PPS1_POSN                  equ 0001h
TUIN0PPS_TUIN0PPS1_POSITION              equ 0001h
TUIN0PPS_TUIN0PPS1_SIZE                  equ 0001h
TUIN0PPS_TUIN0PPS1_LENGTH                equ 0001h
TUIN0PPS_TUIN0PPS1_MASK                  equ 0002h
TUIN0PPS_TUIN0PPS2_POSN                  equ 0002h
TUIN0PPS_TUIN0PPS2_POSITION              equ 0002h
TUIN0PPS_TUIN0PPS2_SIZE                  equ 0001h
TUIN0PPS_TUIN0PPS2_LENGTH                equ 0001h
TUIN0PPS_TUIN0PPS2_MASK                  equ 0004h
TUIN0PPS_TUIN0PPS3_POSN                  equ 0003h
TUIN0PPS_TUIN0PPS3_POSITION              equ 0003h
TUIN0PPS_TUIN0PPS3_SIZE                  equ 0001h
TUIN0PPS_TUIN0PPS3_LENGTH                equ 0001h
TUIN0PPS_TUIN0PPS3_MASK                  equ 0008h
TUIN0PPS_TUIN0PPS4_POSN                  equ 0004h
TUIN0PPS_TUIN0PPS4_POSITION              equ 0004h
TUIN0PPS_TUIN0PPS4_SIZE                  equ 0001h
TUIN0PPS_TUIN0PPS4_LENGTH                equ 0001h
TUIN0PPS_TUIN0PPS4_MASK                  equ 0010h

// Register: TUIN1PPS
#define TUIN1PPS TUIN1PPS
TUIN1PPS                                 equ 0366h
// bitfield definitions
TUIN1PPS_TUIN1PPS_POSN                   equ 0000h
TUIN1PPS_TUIN1PPS_POSITION               equ 0000h
TUIN1PPS_TUIN1PPS_SIZE                   equ 0005h
TUIN1PPS_TUIN1PPS_LENGTH                 equ 0005h
TUIN1PPS_TUIN1PPS_MASK                   equ 001Fh
TUIN1PPS_TUIN1PPS0_POSN                  equ 0000h
TUIN1PPS_TUIN1PPS0_POSITION              equ 0000h
TUIN1PPS_TUIN1PPS0_SIZE                  equ 0001h
TUIN1PPS_TUIN1PPS0_LENGTH                equ 0001h
TUIN1PPS_TUIN1PPS0_MASK                  equ 0001h
TUIN1PPS_TUIN1PPS1_POSN                  equ 0001h
TUIN1PPS_TUIN1PPS1_POSITION              equ 0001h
TUIN1PPS_TUIN1PPS1_SIZE                  equ 0001h
TUIN1PPS_TUIN1PPS1_LENGTH                equ 0001h
TUIN1PPS_TUIN1PPS1_MASK                  equ 0002h
TUIN1PPS_TUIN1PPS2_POSN                  equ 0002h
TUIN1PPS_TUIN1PPS2_POSITION              equ 0002h
TUIN1PPS_TUIN1PPS2_SIZE                  equ 0001h
TUIN1PPS_TUIN1PPS2_LENGTH                equ 0001h
TUIN1PPS_TUIN1PPS2_MASK                  equ 0004h
TUIN1PPS_TUIN1PPS3_POSN                  equ 0003h
TUIN1PPS_TUIN1PPS3_POSITION              equ 0003h
TUIN1PPS_TUIN1PPS3_SIZE                  equ 0001h
TUIN1PPS_TUIN1PPS3_LENGTH                equ 0001h
TUIN1PPS_TUIN1PPS3_MASK                  equ 0008h
TUIN1PPS_TUIN1PPS4_POSN                  equ 0004h
TUIN1PPS_TUIN1PPS4_POSITION              equ 0004h
TUIN1PPS_TUIN1PPS4_SIZE                  equ 0001h
TUIN1PPS_TUIN1PPS4_LENGTH                equ 0001h
TUIN1PPS_TUIN1PPS4_MASK                  equ 0010h

// Register: CCP1PPS
#define CCP1PPS CCP1PPS
CCP1PPS                                  equ 0369h
// bitfield definitions
CCP1PPS_CCP1PPS_POSN                     equ 0000h
CCP1PPS_CCP1PPS_POSITION                 equ 0000h
CCP1PPS_CCP1PPS_SIZE                     equ 0005h
CCP1PPS_CCP1PPS_LENGTH                   equ 0005h
CCP1PPS_CCP1PPS_MASK                     equ 001Fh
CCP1PPS_CCP1PPS0_POSN                    equ 0000h
CCP1PPS_CCP1PPS0_POSITION                equ 0000h
CCP1PPS_CCP1PPS0_SIZE                    equ 0001h
CCP1PPS_CCP1PPS0_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS0_MASK                    equ 0001h
CCP1PPS_CCP1PPS1_POSN                    equ 0001h
CCP1PPS_CCP1PPS1_POSITION                equ 0001h
CCP1PPS_CCP1PPS1_SIZE                    equ 0001h
CCP1PPS_CCP1PPS1_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS1_MASK                    equ 0002h
CCP1PPS_CCP1PPS2_POSN                    equ 0002h
CCP1PPS_CCP1PPS2_POSITION                equ 0002h
CCP1PPS_CCP1PPS2_SIZE                    equ 0001h
CCP1PPS_CCP1PPS2_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS2_MASK                    equ 0004h
CCP1PPS_CCP1PPS3_POSN                    equ 0003h
CCP1PPS_CCP1PPS3_POSITION                equ 0003h
CCP1PPS_CCP1PPS3_SIZE                    equ 0001h
CCP1PPS_CCP1PPS3_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS3_MASK                    equ 0008h
CCP1PPS_CCP1PPS4_POSN                    equ 0004h
CCP1PPS_CCP1PPS4_POSITION                equ 0004h
CCP1PPS_CCP1PPS4_SIZE                    equ 0001h
CCP1PPS_CCP1PPS4_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS4_MASK                    equ 0010h

// Register: CCP2PPS
#define CCP2PPS CCP2PPS
CCP2PPS                                  equ 036Ah
// bitfield definitions
CCP2PPS_CCP2PPS_POSN                     equ 0000h
CCP2PPS_CCP2PPS_POSITION                 equ 0000h
CCP2PPS_CCP2PPS_SIZE                     equ 0005h
CCP2PPS_CCP2PPS_LENGTH                   equ 0005h
CCP2PPS_CCP2PPS_MASK                     equ 001Fh
CCP2PPS_CCP2PPS0_POSN                    equ 0000h
CCP2PPS_CCP2PPS0_POSITION                equ 0000h
CCP2PPS_CCP2PPS0_SIZE                    equ 0001h
CCP2PPS_CCP2PPS0_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS0_MASK                    equ 0001h
CCP2PPS_CCP2PPS1_POSN                    equ 0001h
CCP2PPS_CCP2PPS1_POSITION                equ 0001h
CCP2PPS_CCP2PPS1_SIZE                    equ 0001h
CCP2PPS_CCP2PPS1_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS1_MASK                    equ 0002h
CCP2PPS_CCP2PPS2_POSN                    equ 0002h
CCP2PPS_CCP2PPS2_POSITION                equ 0002h
CCP2PPS_CCP2PPS2_SIZE                    equ 0001h
CCP2PPS_CCP2PPS2_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS2_MASK                    equ 0004h
CCP2PPS_CCP2PPS3_POSN                    equ 0003h
CCP2PPS_CCP2PPS3_POSITION                equ 0003h
CCP2PPS_CCP2PPS3_SIZE                    equ 0001h
CCP2PPS_CCP2PPS3_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS3_MASK                    equ 0008h
CCP2PPS_CCP2PPS4_POSN                    equ 0004h
CCP2PPS_CCP2PPS4_POSITION                equ 0004h
CCP2PPS_CCP2PPS4_SIZE                    equ 0001h
CCP2PPS_CCP2PPS4_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS4_MASK                    equ 0010h

// Register: STATUS_CSHAD
#define STATUS_CSHAD STATUS_CSHAD
STATUS_CSHAD                             equ 0373h
// bitfield definitions
STATUS_CSHAD_NOT_PD_POSN                 equ 0005h
STATUS_CSHAD_NOT_PD_POSITION             equ 0005h
STATUS_CSHAD_NOT_PD_SIZE                 equ 0001h
STATUS_CSHAD_NOT_PD_LENGTH               equ 0001h
STATUS_CSHAD_NOT_PD_MASK                 equ 0020h
STATUS_CSHAD_NOT_TO_POSN                 equ 0006h
STATUS_CSHAD_NOT_TO_POSITION             equ 0006h
STATUS_CSHAD_NOT_TO_SIZE                 equ 0001h
STATUS_CSHAD_NOT_TO_LENGTH               equ 0001h
STATUS_CSHAD_NOT_TO_MASK                 equ 0040h
STATUS_CSHAD_C_POSN                      equ 0000h
STATUS_CSHAD_C_POSITION                  equ 0000h
STATUS_CSHAD_C_SIZE                      equ 0001h
STATUS_CSHAD_C_LENGTH                    equ 0001h
STATUS_CSHAD_C_MASK                      equ 0001h
STATUS_CSHAD_DC_POSN                     equ 0001h
STATUS_CSHAD_DC_POSITION                 equ 0001h
STATUS_CSHAD_DC_SIZE                     equ 0001h
STATUS_CSHAD_DC_LENGTH                   equ 0001h
STATUS_CSHAD_DC_MASK                     equ 0002h
STATUS_CSHAD_Z_POSN                      equ 0002h
STATUS_CSHAD_Z_POSITION                  equ 0002h
STATUS_CSHAD_Z_SIZE                      equ 0001h
STATUS_CSHAD_Z_LENGTH                    equ 0001h
STATUS_CSHAD_Z_MASK                      equ 0004h
STATUS_CSHAD_OV_POSN                     equ 0003h
STATUS_CSHAD_OV_POSITION                 equ 0003h
STATUS_CSHAD_OV_SIZE                     equ 0001h
STATUS_CSHAD_OV_LENGTH                   equ 0001h
STATUS_CSHAD_OV_MASK                     equ 0008h
STATUS_CSHAD_N_POSN                      equ 0004h
STATUS_CSHAD_N_POSITION                  equ 0004h
STATUS_CSHAD_N_SIZE                      equ 0001h
STATUS_CSHAD_N_LENGTH                    equ 0001h
STATUS_CSHAD_N_MASK                      equ 0010h
STATUS_CSHAD_nPD_POSN                    equ 0005h
STATUS_CSHAD_nPD_POSITION                equ 0005h
STATUS_CSHAD_nPD_SIZE                    equ 0001h
STATUS_CSHAD_nPD_LENGTH                  equ 0001h
STATUS_CSHAD_nPD_MASK                    equ 0020h
STATUS_CSHAD_nTO_POSN                    equ 0006h
STATUS_CSHAD_nTO_POSITION                equ 0006h
STATUS_CSHAD_nTO_SIZE                    equ 0001h
STATUS_CSHAD_nTO_LENGTH                  equ 0001h
STATUS_CSHAD_nTO_MASK                    equ 0040h
STATUS_CSHAD_PD_POSN                     equ 0005h
STATUS_CSHAD_PD_POSITION                 equ 0005h
STATUS_CSHAD_PD_SIZE                     equ 0001h
STATUS_CSHAD_PD_LENGTH                   equ 0001h
STATUS_CSHAD_PD_MASK                     equ 0020h
STATUS_CSHAD_TO_POSN                     equ 0006h
STATUS_CSHAD_TO_POSITION                 equ 0006h
STATUS_CSHAD_TO_SIZE                     equ 0001h
STATUS_CSHAD_TO_LENGTH                   equ 0001h
STATUS_CSHAD_TO_MASK                     equ 0040h

// Register: WREG_CSHAD
#define WREG_CSHAD WREG_CSHAD
WREG_CSHAD                               equ 0374h
// bitfield definitions
WREG_CSHAD_WREG_POSN                     equ 0000h
WREG_CSHAD_WREG_POSITION                 equ 0000h
WREG_CSHAD_WREG_SIZE                     equ 0008h
WREG_CSHAD_WREG_LENGTH                   equ 0008h
WREG_CSHAD_WREG_MASK                     equ 00FFh

// Register: BSR_CSHAD
#define BSR_CSHAD BSR_CSHAD
BSR_CSHAD                                equ 0375h

// Register: SHADCON
#define SHADCON SHADCON
SHADCON                                  equ 0376h
// bitfield definitions
SHADCON_SHADLO_POSN                      equ 0000h
SHADCON_SHADLO_POSITION                  equ 0000h
SHADCON_SHADLO_SIZE                      equ 0001h
SHADCON_SHADLO_LENGTH                    equ 0001h
SHADCON_SHADLO_MASK                      equ 0001h

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
STATUS_SHAD                              equ 0377h
// bitfield definitions
STATUS_SHAD_NOT_PD_POSN                  equ 0005h
STATUS_SHAD_NOT_PD_POSITION              equ 0005h
STATUS_SHAD_NOT_PD_SIZE                  equ 0001h
STATUS_SHAD_NOT_PD_LENGTH                equ 0001h
STATUS_SHAD_NOT_PD_MASK                  equ 0020h
STATUS_SHAD_NOT_TO_POSN                  equ 0006h
STATUS_SHAD_NOT_TO_POSITION              equ 0006h
STATUS_SHAD_NOT_TO_SIZE                  equ 0001h
STATUS_SHAD_NOT_TO_LENGTH                equ 0001h
STATUS_SHAD_NOT_TO_MASK                  equ 0040h
STATUS_SHAD_C_POSN                       equ 0000h
STATUS_SHAD_C_POSITION                   equ 0000h
STATUS_SHAD_C_SIZE                       equ 0001h
STATUS_SHAD_C_LENGTH                     equ 0001h
STATUS_SHAD_C_MASK                       equ 0001h
STATUS_SHAD_DC_POSN                      equ 0001h
STATUS_SHAD_DC_POSITION                  equ 0001h
STATUS_SHAD_DC_SIZE                      equ 0001h
STATUS_SHAD_DC_LENGTH                    equ 0001h
STATUS_SHAD_DC_MASK                      equ 0002h
STATUS_SHAD_Z_POSN                       equ 0002h
STATUS_SHAD_Z_POSITION                   equ 0002h
STATUS_SHAD_Z_SIZE                       equ 0001h
STATUS_SHAD_Z_LENGTH                     equ 0001h
STATUS_SHAD_Z_MASK                       equ 0004h
STATUS_SHAD_OV_POSN                      equ 0003h
STATUS_SHAD_OV_POSITION                  equ 0003h
STATUS_SHAD_OV_SIZE                      equ 0001h
STATUS_SHAD_OV_LENGTH                    equ 0001h
STATUS_SHAD_OV_MASK                      equ 0008h
STATUS_SHAD_N_POSN                       equ 0004h
STATUS_SHAD_N_POSITION                   equ 0004h
STATUS_SHAD_N_SIZE                       equ 0001h
STATUS_SHAD_N_LENGTH                     equ 0001h
STATUS_SHAD_N_MASK                       equ 0010h
STATUS_SHAD_nPD_POSN                     equ 0005h
STATUS_SHAD_nPD_POSITION                 equ 0005h
STATUS_SHAD_nPD_SIZE                     equ 0001h
STATUS_SHAD_nPD_LENGTH                   equ 0001h
STATUS_SHAD_nPD_MASK                     equ 0020h
STATUS_SHAD_nTO_POSN                     equ 0006h
STATUS_SHAD_nTO_POSITION                 equ 0006h
STATUS_SHAD_nTO_SIZE                     equ 0001h
STATUS_SHAD_nTO_LENGTH                   equ 0001h
STATUS_SHAD_nTO_MASK                     equ 0040h
STATUS_SHAD_PD_POSN                      equ 0005h
STATUS_SHAD_PD_POSITION                  equ 0005h
STATUS_SHAD_PD_SIZE                      equ 0001h
STATUS_SHAD_PD_LENGTH                    equ 0001h
STATUS_SHAD_PD_MASK                      equ 0020h
STATUS_SHAD_TO_POSN                      equ 0006h
STATUS_SHAD_TO_POSITION                  equ 0006h
STATUS_SHAD_TO_SIZE                      equ 0001h
STATUS_SHAD_TO_LENGTH                    equ 0001h
STATUS_SHAD_TO_MASK                      equ 0040h

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
WREG_SHAD                                equ 0378h
// bitfield definitions
WREG_SHAD_WREG_POSN                      equ 0000h
WREG_SHAD_WREG_POSITION                  equ 0000h
WREG_SHAD_WREG_SIZE                      equ 0008h
WREG_SHAD_WREG_LENGTH                    equ 0008h
WREG_SHAD_WREG_MASK                      equ 00FFh

// Register: BSR_SHAD
#define BSR_SHAD BSR_SHAD
BSR_SHAD                                 equ 0379h

// Register: PCLAT_SHAD
#define PCLAT_SHAD PCLAT_SHAD
PCLAT_SHAD                               equ 037Ah

// Register: PCLATH_SHAD
#define PCLATH_SHAD PCLATH_SHAD
PCLATH_SHAD                              equ 037Ah
// bitfield definitions
PCLATH_SHAD_PCH_POSN                     equ 0000h
PCLATH_SHAD_PCH_POSITION                 equ 0000h
PCLATH_SHAD_PCH_SIZE                     equ 0008h
PCLATH_SHAD_PCH_LENGTH                   equ 0008h
PCLATH_SHAD_PCH_MASK                     equ 00FFh

