garyPenhook/PIC-Assembler/device_includes/pic18f05q20.inc
// Register: PCLATU_SHAD
#define PCLATU_SHAD PCLATU_SHAD
PCLATU_SHAD                              equ 037Bh
// bitfield definitions
PCLATU_SHAD_PCU_POSN                     equ 0000h
PCLATU_SHAD_PCU_POSITION                 equ 0000h
PCLATU_SHAD_PCU_SIZE                     equ 0005h
PCLATU_SHAD_PCU_LENGTH                   equ 0005h
PCLATU_SHAD_PCU_MASK                     equ 001Fh

// Register: FSR0_SHAD
#define FSR0_SHAD FSR0_SHAD
FSR0_SHAD                                equ 037Ch

// Register: FSR0L_SHAD
#define FSR0L_SHAD FSR0L_SHAD
FSR0L_SHAD                               equ 037Ch
// bitfield definitions
FSR0L_SHAD_FSR0L_POSN                    equ 0000h
FSR0L_SHAD_FSR0L_POSITION                equ 0000h
FSR0L_SHAD_FSR0L_SIZE                    equ 0008h
FSR0L_SHAD_FSR0L_LENGTH                  equ 0008h
FSR0L_SHAD_FSR0L_MASK                    equ 00FFh

// Register: FSR0H_SHAD
#define FSR0H_SHAD FSR0H_SHAD
FSR0H_SHAD                               equ 037Dh
// bitfield definitions
FSR0H_SHAD_FSR0H_POSN                    equ 0000h
FSR0H_SHAD_FSR0H_POSITION                equ 0000h
FSR0H_SHAD_FSR0H_SIZE                    equ 0006h
FSR0H_SHAD_FSR0H_LENGTH                  equ 0006h
FSR0H_SHAD_FSR0H_MASK                    equ 003Fh

// Register: FSR1_SHAD
#define FSR1_SHAD FSR1_SHAD
FSR1_SHAD                                equ 037Eh

// Register: FSR1L_SHAD
#define FSR1L_SHAD FSR1L_SHAD
FSR1L_SHAD                               equ 037Eh
// bitfield definitions
FSR1L_SHAD_FSR1L_POSN                    equ 0000h
FSR1L_SHAD_FSR1L_POSITION                equ 0000h
FSR1L_SHAD_FSR1L_SIZE                    equ 0008h
FSR1L_SHAD_FSR1L_LENGTH                  equ 0008h
FSR1L_SHAD_FSR1L_MASK                    equ 00FFh

// Register: FSR1H_SHAD
#define FSR1H_SHAD FSR1H_SHAD
FSR1H_SHAD                               equ 037Fh
// bitfield definitions
FSR1H_SHAD_FSR1H_POSN                    equ 0000h
FSR1H_SHAD_FSR1H_POSITION                equ 0000h
FSR1H_SHAD_FSR1H_SIZE                    equ 0006h
FSR1H_SHAD_FSR1H_LENGTH                  equ 0006h
FSR1H_SHAD_FSR1H_MASK                    equ 003Fh

// Register: FSR2_SHAD
#define FSR2_SHAD FSR2_SHAD
FSR2_SHAD                                equ 0380h

// Register: FSR2L_SHAD
#define FSR2L_SHAD FSR2L_SHAD
FSR2L_SHAD                               equ 0380h
// bitfield definitions
FSR2L_SHAD_FSR2L_POSN                    equ 0000h
FSR2L_SHAD_FSR2L_POSITION                equ 0000h
FSR2L_SHAD_FSR2L_SIZE                    equ 0008h
FSR2L_SHAD_FSR2L_LENGTH                  equ 0008h
FSR2L_SHAD_FSR2L_MASK                    equ 00FFh

// Register: FSR2H_SHAD
#define FSR2H_SHAD FSR2H_SHAD
FSR2H_SHAD                               equ 0381h
// bitfield definitions
FSR2H_SHAD_FSR2H_POSN                    equ 0000h
FSR2H_SHAD_FSR2H_POSITION                equ 0000h
FSR2H_SHAD_FSR2H_SIZE                    equ 0006h
FSR2H_SHAD_FSR2H_LENGTH                  equ 0006h
FSR2H_SHAD_FSR2H_MASK                    equ 003Fh

// Register: PROD_SHAD
#define PROD_SHAD PROD_SHAD
PROD_SHAD                                equ 0382h

// Register: PRODL_SHAD
#define PRODL_SHAD PRODL_SHAD
PRODL_SHAD                               equ 0382h
// bitfield definitions
PRODL_SHAD_PRODL_POSN                    equ 0000h
PRODL_SHAD_PRODL_POSITION                equ 0000h
PRODL_SHAD_PRODL_SIZE                    equ 0008h
PRODL_SHAD_PRODL_LENGTH                  equ 0008h
PRODL_SHAD_PRODL_MASK                    equ 00FFh

// Register: PRODH_SHAD
#define PRODH_SHAD PRODH_SHAD
PRODH_SHAD                               equ 0383h
// bitfield definitions
PRODH_SHAD_PRODH_POSN                    equ 0000h
PRODH_SHAD_PRODH_POSITION                equ 0000h
PRODH_SHAD_PRODH_SIZE                    equ 0008h
PRODH_SHAD_PRODH_LENGTH                  equ 0008h
PRODH_SHAD_PRODH_MASK                    equ 00FFh

// Register: PWMIN0PPS
#define PWMIN0PPS PWMIN0PPS
PWMIN0PPS                                equ 0384h
// bitfield definitions
PWMIN0PPS_PWMIN0PPS_POSN                 equ 0000h
PWMIN0PPS_PWMIN0PPS_POSITION             equ 0000h
PWMIN0PPS_PWMIN0PPS_SIZE                 equ 0005h
PWMIN0PPS_PWMIN0PPS_LENGTH               equ 0005h
PWMIN0PPS_PWMIN0PPS_MASK                 equ 001Fh
PWMIN0PPS_PWMIN0PPS0_POSN                equ 0000h
PWMIN0PPS_PWMIN0PPS0_POSITION            equ 0000h
PWMIN0PPS_PWMIN0PPS0_SIZE                equ 0001h
PWMIN0PPS_PWMIN0PPS0_LENGTH              equ 0001h
PWMIN0PPS_PWMIN0PPS0_MASK                equ 0001h
PWMIN0PPS_PWMIN0PPS1_POSN                equ 0001h
PWMIN0PPS_PWMIN0PPS1_POSITION            equ 0001h
PWMIN0PPS_PWMIN0PPS1_SIZE                equ 0001h
PWMIN0PPS_PWMIN0PPS1_LENGTH              equ 0001h
PWMIN0PPS_PWMIN0PPS1_MASK                equ 0002h
PWMIN0PPS_PWMIN0PPS2_POSN                equ 0002h
PWMIN0PPS_PWMIN0PPS2_POSITION            equ 0002h
PWMIN0PPS_PWMIN0PPS2_SIZE                equ 0001h
PWMIN0PPS_PWMIN0PPS2_LENGTH              equ 0001h
PWMIN0PPS_PWMIN0PPS2_MASK                equ 0004h
PWMIN0PPS_PWMIN0PPS3_POSN                equ 0003h
PWMIN0PPS_PWMIN0PPS3_POSITION            equ 0003h
PWMIN0PPS_PWMIN0PPS3_SIZE                equ 0001h
PWMIN0PPS_PWMIN0PPS3_LENGTH              equ 0001h
PWMIN0PPS_PWMIN0PPS3_MASK                equ 0008h
PWMIN0PPS_PWMIN0PPS4_POSN                equ 0004h
PWMIN0PPS_PWMIN0PPS4_POSITION            equ 0004h
PWMIN0PPS_PWMIN0PPS4_SIZE                equ 0001h
PWMIN0PPS_PWMIN0PPS4_LENGTH              equ 0001h
PWMIN0PPS_PWMIN0PPS4_MASK                equ 0010h

// Register: PWMIN1PPS
#define PWMIN1PPS PWMIN1PPS
PWMIN1PPS                                equ 0385h
// bitfield definitions
PWMIN1PPS_PWMIN1PPS_POSN                 equ 0000h
PWMIN1PPS_PWMIN1PPS_POSITION             equ 0000h
PWMIN1PPS_PWMIN1PPS_SIZE                 equ 0005h
PWMIN1PPS_PWMIN1PPS_LENGTH               equ 0005h
PWMIN1PPS_PWMIN1PPS_MASK                 equ 001Fh
PWMIN1PPS_PWMIN1PPS0_POSN                equ 0000h
PWMIN1PPS_PWMIN1PPS0_POSITION            equ 0000h
PWMIN1PPS_PWMIN1PPS0_SIZE                equ 0001h
PWMIN1PPS_PWMIN1PPS0_LENGTH              equ 0001h
PWMIN1PPS_PWMIN1PPS0_MASK                equ 0001h
PWMIN1PPS_PWMIN1PPS1_POSN                equ 0001h
PWMIN1PPS_PWMIN1PPS1_POSITION            equ 0001h
PWMIN1PPS_PWMIN1PPS1_SIZE                equ 0001h
PWMIN1PPS_PWMIN1PPS1_LENGTH              equ 0001h
PWMIN1PPS_PWMIN1PPS1_MASK                equ 0002h
PWMIN1PPS_PWMIN1PPS2_POSN                equ 0002h
PWMIN1PPS_PWMIN1PPS2_POSITION            equ 0002h
PWMIN1PPS_PWMIN1PPS2_SIZE                equ 0001h
PWMIN1PPS_PWMIN1PPS2_LENGTH              equ 0001h
PWMIN1PPS_PWMIN1PPS2_MASK                equ 0004h
PWMIN1PPS_PWMIN1PPS3_POSN                equ 0003h
PWMIN1PPS_PWMIN1PPS3_POSITION            equ 0003h
PWMIN1PPS_PWMIN1PPS3_SIZE                equ 0001h
PWMIN1PPS_PWMIN1PPS3_LENGTH              equ 0001h
PWMIN1PPS_PWMIN1PPS3_MASK                equ 0008h
PWMIN1PPS_PWMIN1PPS4_POSN                equ 0004h
PWMIN1PPS_PWMIN1PPS4_POSITION            equ 0004h
PWMIN1PPS_PWMIN1PPS4_SIZE                equ 0001h
PWMIN1PPS_PWMIN1PPS4_LENGTH              equ 0001h
PWMIN1PPS_PWMIN1PPS4_MASK                equ 0010h

// Register: PWM1ERSPPS
#define PWM1ERSPPS PWM1ERSPPS
PWM1ERSPPS                               equ 0386h
// bitfield definitions
PWM1ERSPPS_PWM1ERSPPS_POSN               equ 0000h
PWM1ERSPPS_PWM1ERSPPS_POSITION           equ 0000h
PWM1ERSPPS_PWM1ERSPPS_SIZE               equ 0005h
PWM1ERSPPS_PWM1ERSPPS_LENGTH             equ 0005h
PWM1ERSPPS_PWM1ERSPPS_MASK               equ 001Fh
PWM1ERSPPS_PWM1ERSPPS0_POSN              equ 0000h
PWM1ERSPPS_PWM1ERSPPS0_POSITION          equ 0000h
PWM1ERSPPS_PWM1ERSPPS0_SIZE              equ 0001h
PWM1ERSPPS_PWM1ERSPPS0_LENGTH            equ 0001h
PWM1ERSPPS_PWM1ERSPPS0_MASK              equ 0001h
PWM1ERSPPS_PWM1ERSPPS1_POSN              equ 0001h
PWM1ERSPPS_PWM1ERSPPS1_POSITION          equ 0001h
PWM1ERSPPS_PWM1ERSPPS1_SIZE              equ 0001h
PWM1ERSPPS_PWM1ERSPPS1_LENGTH            equ 0001h
PWM1ERSPPS_PWM1ERSPPS1_MASK              equ 0002h
PWM1ERSPPS_PWM1ERSPPS2_POSN              equ 0002h
PWM1ERSPPS_PWM1ERSPPS2_POSITION          equ 0002h
PWM1ERSPPS_PWM1ERSPPS2_SIZE              equ 0001h
PWM1ERSPPS_PWM1ERSPPS2_LENGTH            equ 0001h
PWM1ERSPPS_PWM1ERSPPS2_MASK              equ 0004h
PWM1ERSPPS_PWM1ERSPPS3_POSN              equ 0003h
PWM1ERSPPS_PWM1ERSPPS3_POSITION          equ 0003h
PWM1ERSPPS_PWM1ERSPPS3_SIZE              equ 0001h
PWM1ERSPPS_PWM1ERSPPS3_LENGTH            equ 0001h
PWM1ERSPPS_PWM1ERSPPS3_MASK              equ 0008h
PWM1ERSPPS_PWM1ERSPPS4_POSN              equ 0004h
PWM1ERSPPS_PWM1ERSPPS4_POSITION          equ 0004h
PWM1ERSPPS_PWM1ERSPPS4_SIZE              equ 0001h
PWM1ERSPPS_PWM1ERSPPS4_LENGTH            equ 0001h
PWM1ERSPPS_PWM1ERSPPS4_MASK              equ 0010h

// Register: PWM2ERSPPS
#define PWM2ERSPPS PWM2ERSPPS
PWM2ERSPPS                               equ 0387h
// bitfield definitions
PWM2ERSPPS_PWM2ERSPPS_POSN               equ 0000h
PWM2ERSPPS_PWM2ERSPPS_POSITION           equ 0000h
PWM2ERSPPS_PWM2ERSPPS_SIZE               equ 0005h
PWM2ERSPPS_PWM2ERSPPS_LENGTH             equ 0005h
PWM2ERSPPS_PWM2ERSPPS_MASK               equ 001Fh
PWM2ERSPPS_PWM2ERSPPS0_POSN              equ 0000h
PWM2ERSPPS_PWM2ERSPPS0_POSITION          equ 0000h
PWM2ERSPPS_PWM2ERSPPS0_SIZE              equ 0001h
PWM2ERSPPS_PWM2ERSPPS0_LENGTH            equ 0001h
PWM2ERSPPS_PWM2ERSPPS0_MASK              equ 0001h
PWM2ERSPPS_PWM2ERSPPS1_POSN              equ 0001h
PWM2ERSPPS_PWM2ERSPPS1_POSITION          equ 0001h
PWM2ERSPPS_PWM2ERSPPS1_SIZE              equ 0001h
PWM2ERSPPS_PWM2ERSPPS1_LENGTH            equ 0001h
PWM2ERSPPS_PWM2ERSPPS1_MASK              equ 0002h
PWM2ERSPPS_PWM2ERSPPS2_POSN              equ 0002h
PWM2ERSPPS_PWM2ERSPPS2_POSITION          equ 0002h
PWM2ERSPPS_PWM2ERSPPS2_SIZE              equ 0001h
PWM2ERSPPS_PWM2ERSPPS2_LENGTH            equ 0001h
PWM2ERSPPS_PWM2ERSPPS2_MASK              equ 0004h
PWM2ERSPPS_PWM2ERSPPS3_POSN              equ 0003h
PWM2ERSPPS_PWM2ERSPPS3_POSITION          equ 0003h
PWM2ERSPPS_PWM2ERSPPS3_SIZE              equ 0001h
PWM2ERSPPS_PWM2ERSPPS3_LENGTH            equ 0001h
PWM2ERSPPS_PWM2ERSPPS3_MASK              equ 0008h
PWM2ERSPPS_PWM2ERSPPS4_POSN              equ 0004h
PWM2ERSPPS_PWM2ERSPPS4_POSITION          equ 0004h
PWM2ERSPPS_PWM2ERSPPS4_SIZE              equ 0001h
PWM2ERSPPS_PWM2ERSPPS4_LENGTH            equ 0001h
PWM2ERSPPS_PWM2ERSPPS4_MASK              equ 0010h

// Register: CWG1PPS
#define CWG1PPS CWG1PPS
CWG1PPS                                  equ 0399h
// bitfield definitions
CWG1PPS_CWG1INPPS_POSN                   equ 0000h
CWG1PPS_CWG1INPPS_POSITION               equ 0000h
CWG1PPS_CWG1INPPS_SIZE                   equ 0005h
CWG1PPS_CWG1INPPS_LENGTH                 equ 0005h
CWG1PPS_CWG1INPPS_MASK                   equ 001Fh
CWG1PPS_CWGINPPS0_POSN                   equ 0000h
CWG1PPS_CWGINPPS0_POSITION               equ 0000h
CWG1PPS_CWGINPPS0_SIZE                   equ 0001h
CWG1PPS_CWGINPPS0_LENGTH                 equ 0001h
CWG1PPS_CWGINPPS0_MASK                   equ 0001h
CWG1PPS_CWGINPPS1_POSN                   equ 0001h
CWG1PPS_CWGINPPS1_POSITION               equ 0001h
CWG1PPS_CWGINPPS1_SIZE                   equ 0001h
CWG1PPS_CWGINPPS1_LENGTH                 equ 0001h
CWG1PPS_CWGINPPS1_MASK                   equ 0002h
CWG1PPS_CWGINPPS2_POSN                   equ 0002h
CWG1PPS_CWGINPPS2_POSITION               equ 0002h
CWG1PPS_CWGINPPS2_SIZE                   equ 0001h
CWG1PPS_CWGINPPS2_LENGTH                 equ 0001h
CWG1PPS_CWGINPPS2_MASK                   equ 0004h
CWG1PPS_CWGINPPS3_POSN                   equ 0003h
CWG1PPS_CWGINPPS3_POSITION               equ 0003h
CWG1PPS_CWGINPPS3_SIZE                   equ 0001h
CWG1PPS_CWGINPPS3_LENGTH                 equ 0001h
CWG1PPS_CWGINPPS3_MASK                   equ 0008h
CWG1PPS_CWGINPPS4_POSN                   equ 0004h
CWG1PPS_CWGINPPS4_POSITION               equ 0004h
CWG1PPS_CWGINPPS4_SIZE                   equ 0001h
CWG1PPS_CWGINPPS4_LENGTH                 equ 0001h
CWG1PPS_CWGINPPS4_MASK                   equ 0010h
CWG1PPS_CWG1INPPS0_POSN                  equ 0000h
CWG1PPS_CWG1INPPS0_POSITION              equ 0000h
CWG1PPS_CWG1INPPS0_SIZE                  equ 0001h
CWG1PPS_CWG1INPPS0_LENGTH                equ 0001h
CWG1PPS_CWG1INPPS0_MASK                  equ 0001h
CWG1PPS_CWG1INPPS1_POSN                  equ 0001h
CWG1PPS_CWG1INPPS1_POSITION              equ 0001h
CWG1PPS_CWG1INPPS1_SIZE                  equ 0001h
CWG1PPS_CWG1INPPS1_LENGTH                equ 0001h
CWG1PPS_CWG1INPPS1_MASK                  equ 0002h
CWG1PPS_CWG1INPPS2_POSN                  equ 0002h
CWG1PPS_CWG1INPPS2_POSITION              equ 0002h
CWG1PPS_CWG1INPPS2_SIZE                  equ 0001h
CWG1PPS_CWG1INPPS2_LENGTH                equ 0001h
CWG1PPS_CWG1INPPS2_MASK                  equ 0004h
CWG1PPS_CWG1INPPS3_POSN                  equ 0003h
CWG1PPS_CWG1INPPS3_POSITION              equ 0003h
CWG1PPS_CWG1INPPS3_SIZE                  equ 0001h
CWG1PPS_CWG1INPPS3_LENGTH                equ 0001h
CWG1PPS_CWG1INPPS3_MASK                  equ 0008h
CWG1PPS_CWG1INPPS4_POSN                  equ 0004h
CWG1PPS_CWG1INPPS4_POSITION              equ 0004h
CWG1PPS_CWG1INPPS4_SIZE                  equ 0001h
CWG1PPS_CWG1INPPS4_LENGTH                equ 0001h
CWG1PPS_CWG1INPPS4_MASK                  equ 0010h
CWG1PPS_CWGINPPS_POSN                    equ 0000h
CWG1PPS_CWGINPPS_POSITION                equ 0000h
CWG1PPS_CWGINPPS_SIZE                    equ 0005h
CWG1PPS_CWGINPPS_LENGTH                  equ 0005h
CWG1PPS_CWGINPPS_MASK                    equ 001Fh

