garyPenhook/PIC-Assembler/device_includes/pic18f05q20.inc
// Register: U2RXPPS
#define U2RXPPS U2RXPPS
U2RXPPS                                  equ 03A4h
// bitfield definitions
U2RXPPS_U2RXPPS_POSN                     equ 0000h
U2RXPPS_U2RXPPS_POSITION                 equ 0000h
U2RXPPS_U2RXPPS_SIZE                     equ 0005h
U2RXPPS_U2RXPPS_LENGTH                   equ 0005h
U2RXPPS_U2RXPPS_MASK                     equ 001Fh
U2RXPPS_U2RXPPS0_POSN                    equ 0000h
U2RXPPS_U2RXPPS0_POSITION                equ 0000h
U2RXPPS_U2RXPPS0_SIZE                    equ 0001h
U2RXPPS_U2RXPPS0_LENGTH                  equ 0001h
U2RXPPS_U2RXPPS0_MASK                    equ 0001h
U2RXPPS_U2RXPPS1_POSN                    equ 0001h
U2RXPPS_U2RXPPS1_POSITION                equ 0001h
U2RXPPS_U2RXPPS1_SIZE                    equ 0001h
U2RXPPS_U2RXPPS1_LENGTH                  equ 0001h
U2RXPPS_U2RXPPS1_MASK                    equ 0002h
U2RXPPS_U2RXPPS2_POSN                    equ 0002h
U2RXPPS_U2RXPPS2_POSITION                equ 0002h
U2RXPPS_U2RXPPS2_SIZE                    equ 0001h
U2RXPPS_U2RXPPS2_LENGTH                  equ 0001h
U2RXPPS_U2RXPPS2_MASK                    equ 0004h
U2RXPPS_U2RXPPS3_POSN                    equ 0003h
U2RXPPS_U2RXPPS3_POSITION                equ 0003h
U2RXPPS_U2RXPPS3_SIZE                    equ 0001h
U2RXPPS_U2RXPPS3_LENGTH                  equ 0001h
U2RXPPS_U2RXPPS3_MASK                    equ 0008h
U2RXPPS_U2RXPPS4_POSN                    equ 0004h
U2RXPPS_U2RXPPS4_POSITION                equ 0004h
U2RXPPS_U2RXPPS4_SIZE                    equ 0001h
U2RXPPS_U2RXPPS4_LENGTH                  equ 0001h
U2RXPPS_U2RXPPS4_MASK                    equ 0010h

// Register: SPI1SCKPPS
#define SPI1SCKPPS SPI1SCKPPS
SPI1SCKPPS                               equ 03A7h
// bitfield definitions
SPI1SCKPPS_SPI1SCKPPS_POSN               equ 0000h
SPI1SCKPPS_SPI1SCKPPS_POSITION           equ 0000h
SPI1SCKPPS_SPI1SCKPPS_SIZE               equ 0005h
SPI1SCKPPS_SPI1SCKPPS_LENGTH             equ 0005h
SPI1SCKPPS_SPI1SCKPPS_MASK               equ 001Fh
SPI1SCKPPS_SPI1SCKPPS0_POSN              equ 0000h
SPI1SCKPPS_SPI1SCKPPS0_POSITION          equ 0000h
SPI1SCKPPS_SPI1SCKPPS0_SIZE              equ 0001h
SPI1SCKPPS_SPI1SCKPPS0_LENGTH            equ 0001h
SPI1SCKPPS_SPI1SCKPPS0_MASK              equ 0001h
SPI1SCKPPS_SPI1SCKPPS1_POSN              equ 0001h
SPI1SCKPPS_SPI1SCKPPS1_POSITION          equ 0001h
SPI1SCKPPS_SPI1SCKPPS1_SIZE              equ 0001h
SPI1SCKPPS_SPI1SCKPPS1_LENGTH            equ 0001h
SPI1SCKPPS_SPI1SCKPPS1_MASK              equ 0002h
SPI1SCKPPS_SPI1SCKPPS2_POSN              equ 0002h
SPI1SCKPPS_SPI1SCKPPS2_POSITION          equ 0002h
SPI1SCKPPS_SPI1SCKPPS2_SIZE              equ 0001h
SPI1SCKPPS_SPI1SCKPPS2_LENGTH            equ 0001h
SPI1SCKPPS_SPI1SCKPPS2_MASK              equ 0004h
SPI1SCKPPS_SPI1SCKPPS3_POSN              equ 0003h
SPI1SCKPPS_SPI1SCKPPS3_POSITION          equ 0003h
SPI1SCKPPS_SPI1SCKPPS3_SIZE              equ 0001h
SPI1SCKPPS_SPI1SCKPPS3_LENGTH            equ 0001h
SPI1SCKPPS_SPI1SCKPPS3_MASK              equ 0008h
SPI1SCKPPS_SPI1SCKPPS4_POSN              equ 0004h
SPI1SCKPPS_SPI1SCKPPS4_POSITION          equ 0004h
SPI1SCKPPS_SPI1SCKPPS4_SIZE              equ 0001h
SPI1SCKPPS_SPI1SCKPPS4_LENGTH            equ 0001h
SPI1SCKPPS_SPI1SCKPPS4_MASK              equ 0010h

// Register: SPI1SDIPPS
#define SPI1SDIPPS SPI1SDIPPS
SPI1SDIPPS                               equ 03A8h
// bitfield definitions
SPI1SDIPPS_SPI1SDIPPS_POSN               equ 0000h
SPI1SDIPPS_SPI1SDIPPS_POSITION           equ 0000h
SPI1SDIPPS_SPI1SDIPPS_SIZE               equ 0005h
SPI1SDIPPS_SPI1SDIPPS_LENGTH             equ 0005h
SPI1SDIPPS_SPI1SDIPPS_MASK               equ 001Fh
SPI1SDIPPS_SPI1SDIPPS0_POSN              equ 0000h
SPI1SDIPPS_SPI1SDIPPS0_POSITION          equ 0000h
SPI1SDIPPS_SPI1SDIPPS0_SIZE              equ 0001h
SPI1SDIPPS_SPI1SDIPPS0_LENGTH            equ 0001h
SPI1SDIPPS_SPI1SDIPPS0_MASK              equ 0001h
SPI1SDIPPS_SPI1SDIPPS1_POSN              equ 0001h
SPI1SDIPPS_SPI1SDIPPS1_POSITION          equ 0001h
SPI1SDIPPS_SPI1SDIPPS1_SIZE              equ 0001h
SPI1SDIPPS_SPI1SDIPPS1_LENGTH            equ 0001h
SPI1SDIPPS_SPI1SDIPPS1_MASK              equ 0002h
SPI1SDIPPS_SPI1SDIPPS2_POSN              equ 0002h
SPI1SDIPPS_SPI1SDIPPS2_POSITION          equ 0002h
SPI1SDIPPS_SPI1SDIPPS2_SIZE              equ 0001h
SPI1SDIPPS_SPI1SDIPPS2_LENGTH            equ 0001h
SPI1SDIPPS_SPI1SDIPPS2_MASK              equ 0004h
SPI1SDIPPS_SPI1SDIPPS3_POSN              equ 0003h
SPI1SDIPPS_SPI1SDIPPS3_POSITION          equ 0003h
SPI1SDIPPS_SPI1SDIPPS3_SIZE              equ 0001h
SPI1SDIPPS_SPI1SDIPPS3_LENGTH            equ 0001h
SPI1SDIPPS_SPI1SDIPPS3_MASK              equ 0008h
SPI1SDIPPS_SPI1SDIPPS4_POSN              equ 0004h
SPI1SDIPPS_SPI1SDIPPS4_POSITION          equ 0004h
SPI1SDIPPS_SPI1SDIPPS4_SIZE              equ 0001h
SPI1SDIPPS_SPI1SDIPPS4_LENGTH            equ 0001h
SPI1SDIPPS_SPI1SDIPPS4_MASK              equ 0010h

// Register: SPI1SSPPS
#define SPI1SSPPS SPI1SSPPS
SPI1SSPPS                                equ 03A9h
// bitfield definitions
SPI1SSPPS_SPI1SSPPS_POSN                 equ 0000h
SPI1SSPPS_SPI1SSPPS_POSITION             equ 0000h
SPI1SSPPS_SPI1SSPPS_SIZE                 equ 0005h
SPI1SSPPS_SPI1SSPPS_LENGTH               equ 0005h
SPI1SSPPS_SPI1SSPPS_MASK                 equ 001Fh
SPI1SSPPS_SPI1SSPPS0_POSN                equ 0000h
SPI1SSPPS_SPI1SSPPS0_POSITION            equ 0000h
SPI1SSPPS_SPI1SSPPS0_SIZE                equ 0001h
SPI1SSPPS_SPI1SSPPS0_LENGTH              equ 0001h
SPI1SSPPS_SPI1SSPPS0_MASK                equ 0001h
SPI1SSPPS_SPI1SSPPS1_POSN                equ 0001h
SPI1SSPPS_SPI1SSPPS1_POSITION            equ 0001h
SPI1SSPPS_SPI1SSPPS1_SIZE                equ 0001h
SPI1SSPPS_SPI1SSPPS1_LENGTH              equ 0001h
SPI1SSPPS_SPI1SSPPS1_MASK                equ 0002h
SPI1SSPPS_SPI1SSPPS2_POSN                equ 0002h
SPI1SSPPS_SPI1SSPPS2_POSITION            equ 0002h
SPI1SSPPS_SPI1SSPPS2_SIZE                equ 0001h
SPI1SSPPS_SPI1SSPPS2_LENGTH              equ 0001h
SPI1SSPPS_SPI1SSPPS2_MASK                equ 0004h
SPI1SSPPS_SPI1SSPPS3_POSN                equ 0003h
SPI1SSPPS_SPI1SSPPS3_POSITION            equ 0003h
SPI1SSPPS_SPI1SSPPS3_SIZE                equ 0001h
SPI1SSPPS_SPI1SSPPS3_LENGTH              equ 0001h
SPI1SSPPS_SPI1SSPPS3_MASK                equ 0008h
SPI1SSPPS_SPI1SSPPS4_POSN                equ 0004h
SPI1SSPPS_SPI1SSPPS4_POSITION            equ 0004h
SPI1SSPPS_SPI1SSPPS4_SIZE                equ 0001h
SPI1SSPPS_SPI1SSPPS4_LENGTH              equ 0001h
SPI1SSPPS_SPI1SSPPS4_MASK                equ 0010h

// Register: I2C1SCLPPS
#define I2C1SCLPPS I2C1SCLPPS
I2C1SCLPPS                               equ 03ADh
// bitfield definitions
I2C1SCLPPS_I2C1SCLPPS_POSN               equ 0000h
I2C1SCLPPS_I2C1SCLPPS_POSITION           equ 0000h
I2C1SCLPPS_I2C1SCLPPS_SIZE               equ 0005h
I2C1SCLPPS_I2C1SCLPPS_LENGTH             equ 0005h
I2C1SCLPPS_I2C1SCLPPS_MASK               equ 001Fh
I2C1SCLPPS_I2C1SCLPPS0_POSN              equ 0000h
I2C1SCLPPS_I2C1SCLPPS0_POSITION          equ 0000h
I2C1SCLPPS_I2C1SCLPPS0_SIZE              equ 0001h
I2C1SCLPPS_I2C1SCLPPS0_LENGTH            equ 0001h
I2C1SCLPPS_I2C1SCLPPS0_MASK              equ 0001h
I2C1SCLPPS_I2C1SCLPPS1_POSN              equ 0001h
I2C1SCLPPS_I2C1SCLPPS1_POSITION          equ 0001h
I2C1SCLPPS_I2C1SCLPPS1_SIZE              equ 0001h
I2C1SCLPPS_I2C1SCLPPS1_LENGTH            equ 0001h
I2C1SCLPPS_I2C1SCLPPS1_MASK              equ 0002h
I2C1SCLPPS_I2C1SCLPPS2_POSN              equ 0002h
I2C1SCLPPS_I2C1SCLPPS2_POSITION          equ 0002h
I2C1SCLPPS_I2C1SCLPPS2_SIZE              equ 0001h
I2C1SCLPPS_I2C1SCLPPS2_LENGTH            equ 0001h
I2C1SCLPPS_I2C1SCLPPS2_MASK              equ 0004h
I2C1SCLPPS_I2C1SCLPPS3_POSN              equ 0003h
I2C1SCLPPS_I2C1SCLPPS3_POSITION          equ 0003h
I2C1SCLPPS_I2C1SCLPPS3_SIZE              equ 0001h
I2C1SCLPPS_I2C1SCLPPS3_LENGTH            equ 0001h
I2C1SCLPPS_I2C1SCLPPS3_MASK              equ 0008h
I2C1SCLPPS_I2C1SCLPPS4_POSN              equ 0004h
I2C1SCLPPS_I2C1SCLPPS4_POSITION          equ 0004h
I2C1SCLPPS_I2C1SCLPPS4_SIZE              equ 0001h
I2C1SCLPPS_I2C1SCLPPS4_LENGTH            equ 0001h
I2C1SCLPPS_I2C1SCLPPS4_MASK              equ 0010h

