garyPenhook/PIC-Assembler/device_includes/pic18f05q20.inc
// Register: LATA
#define LATA LATA
LATA                                     equ 0493h
// bitfield definitions
LATA_LATA0_POSN                          equ 0000h
LATA_LATA0_POSITION                      equ 0000h
LATA_LATA0_SIZE                          equ 0001h
LATA_LATA0_LENGTH                        equ 0001h
LATA_LATA0_MASK                          equ 0001h
LATA_LATA1_POSN                          equ 0001h
LATA_LATA1_POSITION                      equ 0001h
LATA_LATA1_SIZE                          equ 0001h
LATA_LATA1_LENGTH                        equ 0001h
LATA_LATA1_MASK                          equ 0002h
LATA_LATA2_POSN                          equ 0002h
LATA_LATA2_POSITION                      equ 0002h
LATA_LATA2_SIZE                          equ 0001h
LATA_LATA2_LENGTH                        equ 0001h
LATA_LATA2_MASK                          equ 0004h
LATA_LATA4_POSN                          equ 0004h
LATA_LATA4_POSITION                      equ 0004h
LATA_LATA4_SIZE                          equ 0001h
LATA_LATA4_LENGTH                        equ 0001h
LATA_LATA4_MASK                          equ 0010h
LATA_LATA5_POSN                          equ 0005h
LATA_LATA5_POSITION                      equ 0005h
LATA_LATA5_SIZE                          equ 0001h
LATA_LATA5_LENGTH                        equ 0001h
LATA_LATA5_MASK                          equ 0020h

// Register: LATC
#define LATC LATC
LATC                                     equ 0495h
// bitfield definitions
LATC_LATC0_POSN                          equ 0000h
LATC_LATC0_POSITION                      equ 0000h
LATC_LATC0_SIZE                          equ 0001h
LATC_LATC0_LENGTH                        equ 0001h
LATC_LATC0_MASK                          equ 0001h
LATC_LATC1_POSN                          equ 0001h
LATC_LATC1_POSITION                      equ 0001h
LATC_LATC1_SIZE                          equ 0001h
LATC_LATC1_LENGTH                        equ 0001h
LATC_LATC1_MASK                          equ 0002h
LATC_LATC3_POSN                          equ 0003h
LATC_LATC3_POSITION                      equ 0003h
LATC_LATC3_SIZE                          equ 0001h
LATC_LATC3_LENGTH                        equ 0001h
LATC_LATC3_MASK                          equ 0008h
LATC_LATC4_POSN                          equ 0004h
LATC_LATC4_POSITION                      equ 0004h
LATC_LATC4_SIZE                          equ 0001h
LATC_LATC4_LENGTH                        equ 0001h
LATC_LATC4_MASK                          equ 0010h
LATC_LATC5_POSN                          equ 0005h
LATC_LATC5_POSITION                      equ 0005h
LATC_LATC5_SIZE                          equ 0001h
LATC_LATC5_LENGTH                        equ 0001h
LATC_LATC5_MASK                          equ 0020h
LATC_LATC6_POSN                          equ 0006h
LATC_LATC6_POSITION                      equ 0006h
LATC_LATC6_SIZE                          equ 0001h
LATC_LATC6_LENGTH                        equ 0001h
LATC_LATC6_MASK                          equ 0040h
LATC_LATC7_POSN                          equ 0007h
LATC_LATC7_POSITION                      equ 0007h
LATC_LATC7_SIZE                          equ 0001h
LATC_LATC7_LENGTH                        equ 0001h
LATC_LATC7_MASK                          equ 0080h

// Register: PORTW
#define PORTW PORTW
PORTW                                    equ 0499h
// bitfield definitions
PORTW_RW0_POSN                           equ 0000h
PORTW_RW0_POSITION                       equ 0000h
PORTW_RW0_SIZE                           equ 0001h
PORTW_RW0_LENGTH                         equ 0001h
PORTW_RW0_MASK                           equ 0001h
PORTW_RW1_POSN                           equ 0001h
PORTW_RW1_POSITION                       equ 0001h
PORTW_RW1_SIZE                           equ 0001h
PORTW_RW1_LENGTH                         equ 0001h
PORTW_RW1_MASK                           equ 0002h
PORTW_RW2_POSN                           equ 0002h
PORTW_RW2_POSITION                       equ 0002h
PORTW_RW2_SIZE                           equ 0001h
PORTW_RW2_LENGTH                         equ 0001h
PORTW_RW2_MASK                           equ 0004h
PORTW_RW3_POSN                           equ 0003h
PORTW_RW3_POSITION                       equ 0003h
PORTW_RW3_SIZE                           equ 0001h
PORTW_RW3_LENGTH                         equ 0001h
PORTW_RW3_MASK                           equ 0008h
PORTW_RW4_POSN                           equ 0004h
PORTW_RW4_POSITION                       equ 0004h
PORTW_RW4_SIZE                           equ 0001h
PORTW_RW4_LENGTH                         equ 0001h
PORTW_RW4_MASK                           equ 0010h
PORTW_RW5_POSN                           equ 0005h
PORTW_RW5_POSITION                       equ 0005h
PORTW_RW5_SIZE                           equ 0001h
PORTW_RW5_LENGTH                         equ 0001h
PORTW_RW5_MASK                           equ 0020h
PORTW_RW6_POSN                           equ 0006h
PORTW_RW6_POSITION                       equ 0006h
PORTW_RW6_SIZE                           equ 0001h
PORTW_RW6_LENGTH                         equ 0001h
PORTW_RW6_MASK                           equ 0040h
PORTW_RW7_POSN                           equ 0007h
PORTW_RW7_POSITION                       equ 0007h
PORTW_RW7_SIZE                           equ 0001h
PORTW_RW7_LENGTH                         equ 0001h
PORTW_RW7_MASK                           equ 0080h

// Register: LATW
#define LATW LATW
LATW                                     equ 049Ah
// bitfield definitions
LATW_LATW0_POSN                          equ 0000h
LATW_LATW0_POSITION                      equ 0000h
LATW_LATW0_SIZE                          equ 0001h
LATW_LATW0_LENGTH                        equ 0001h
LATW_LATW0_MASK                          equ 0001h
LATW_LATW1_POSN                          equ 0001h
LATW_LATW1_POSITION                      equ 0001h
LATW_LATW1_SIZE                          equ 0001h
LATW_LATW1_LENGTH                        equ 0001h
LATW_LATW1_MASK                          equ 0002h
LATW_LATW2_POSN                          equ 0002h
LATW_LATW2_POSITION                      equ 0002h
LATW_LATW2_SIZE                          equ 0001h
LATW_LATW2_LENGTH                        equ 0001h
LATW_LATW2_MASK                          equ 0004h
LATW_LATW3_POSN                          equ 0003h
LATW_LATW3_POSITION                      equ 0003h
LATW_LATW3_SIZE                          equ 0001h
LATW_LATW3_LENGTH                        equ 0001h
LATW_LATW3_MASK                          equ 0008h
LATW_LATW4_POSN                          equ 0004h
LATW_LATW4_POSITION                      equ 0004h
LATW_LATW4_SIZE                          equ 0001h
LATW_LATW4_LENGTH                        equ 0001h
LATW_LATW4_MASK                          equ 0010h
LATW_LATW5_POSN                          equ 0005h
LATW_LATW5_POSITION                      equ 0005h
LATW_LATW5_SIZE                          equ 0001h
LATW_LATW5_LENGTH                        equ 0001h
LATW_LATW5_MASK                          equ 0020h
LATW_LATW6_POSN                          equ 0006h
LATW_LATW6_POSITION                      equ 0006h
LATW_LATW6_SIZE                          equ 0001h
LATW_LATW6_LENGTH                        equ 0001h
LATW_LATW6_MASK                          equ 0040h
LATW_LATW7_POSN                          equ 0007h
LATW_LATW7_POSITION                      equ 0007h
LATW_LATW7_SIZE                          equ 0001h
LATW_LATW7_LENGTH                        equ 0001h
LATW_LATW7_MASK                          equ 0080h

// Register: PORTWIN0
#define PORTWIN0 PORTWIN0
PORTWIN0                                 equ 049Bh
// bitfield definitions
PORTWIN0_IN_POSN                         equ 0000h
PORTWIN0_IN_POSITION                     equ 0000h
PORTWIN0_IN_SIZE                         equ 0008h
PORTWIN0_IN_LENGTH                       equ 0008h
PORTWIN0_IN_MASK                         equ 00FFh
PORTWIN0_IN0_POSN                        equ 0000h
PORTWIN0_IN0_POSITION                    equ 0000h
PORTWIN0_IN0_SIZE                        equ 0001h
PORTWIN0_IN0_LENGTH                      equ 0001h
PORTWIN0_IN0_MASK                        equ 0001h
PORTWIN0_IN1_POSN                        equ 0001h
PORTWIN0_IN1_POSITION                    equ 0001h
PORTWIN0_IN1_SIZE                        equ 0001h
PORTWIN0_IN1_LENGTH                      equ 0001h
PORTWIN0_IN1_MASK                        equ 0002h
PORTWIN0_IN2_POSN                        equ 0002h
PORTWIN0_IN2_POSITION                    equ 0002h
PORTWIN0_IN2_SIZE                        equ 0001h
PORTWIN0_IN2_LENGTH                      equ 0001h
PORTWIN0_IN2_MASK                        equ 0004h

