garyPenhook/PIC-Assembler/device_includes/pic18f05q20.inc
#define SLRC1                            BANKMASK(SLRCONC), 1, b
#define SLRC3                            BANKMASK(SLRCONC), 3, b
#define SLRC4                            BANKMASK(SLRCONC), 4, b
#define SLRC5                            BANKMASK(SLRCONC), 5, b
#define SLRC6                            BANKMASK(SLRCONC), 6, b
#define SLRC7                            BANKMASK(SLRCONC), 7, b
#define SMA                              BANKMASK(I2C1STAT0), 6, b
#define SMP                              BANKMASK(SPI1CON1), 7, b
#define SOI                              BANKMASK(ADCON3), 3, b
#define SOR                              BANKMASK(OSCSTAT), 3, b
#define SOSCEN                           BANKMASK(OSCEN), 3, b
#define SOSCPWR                          BANKMASK(OSCCON3), 6, b
#define SOSIE                            BANKMASK(SPI1INTE), 5, b
#define SOSIF                            BANKMASK(SPI1INTF), 5, b
#define SPI1BMODE                        BANKMASK(SPI1CON0), 0, b
#define SPI1BUSY                         BANKMASK(SPI1CON2), 7, b
#define SPI1CKE                          BANKMASK(SPI1CON1), 6, b
#define SPI1CKP                          BANKMASK(SPI1CON1), 5, b
#define SPI1CLKSEL0                      BANKMASK(SPI1CLK), 0, b
#define SPI1CLKSEL1                      BANKMASK(SPI1CLK), 1, b
#define SPI1CLKSEL2                      BANKMASK(SPI1CLK), 2, b
#define SPI1CLKSEL3                      BANKMASK(SPI1CLK), 3, b
#define SPI1CLRBF                        BANKMASK(SPI1STATUS), 2, b
#define SPI1EOSIE                        BANKMASK(SPI1INTE), 4, b
#define SPI1EOSIF                        BANKMASK(SPI1INTF), 4, b
#define SPI1FST                          BANKMASK(SPI1CON1), 4, b
#define SPI1IE                           BANKMASK(PIE7), 2, a
#define SPI1IF                           BANKMASK(PIR7), 2, a
#define SPI1IP                           BANKMASK(IPR7), 2, a
#define SPI1LSBF                         BANKMASK(SPI1CON0), 2, b
#define SPI1MD                           BANKMASK(PMD3), 5, b
#define SPI1MST                          BANKMASK(SPI1CON0), 1, b
#define SPI1RXBF                         BANKMASK(SPI1STATUS), 0, b
#define SPI1RXIE                         BANKMASK(PIE7), 0, a
#define SPI1RXIF                         BANKMASK(PIR7), 0, a
#define SPI1RXIP                         BANKMASK(IPR7), 0, a
#define SPI1RXOIE                        BANKMASK(SPI1INTE), 2, b
#define SPI1RXOIF                        BANKMASK(SPI1INTF), 2, b
#define SPI1RXR                          BANKMASK(SPI1CON2), 0, b
#define SPI1RXRE                         BANKMASK(SPI1STATUS), 3, b
#define SPI1SCKPPS0                      BANKMASK(SPI1SCKPPS), 0, b
#define SPI1SCKPPS1                      BANKMASK(SPI1SCKPPS), 1, b
#define SPI1SCKPPS2                      BANKMASK(SPI1SCKPPS), 2, b
#define SPI1SCKPPS3                      BANKMASK(SPI1SCKPPS), 3, b
#define SPI1SCKPPS4                      BANKMASK(SPI1SCKPPS), 4, b
#define SPI1SDIP                         BANKMASK(SPI1CON1), 1, b
#define SPI1SDIPPS0                      BANKMASK(SPI1SDIPPS), 0, b
#define SPI1SDIPPS1                      BANKMASK(SPI1SDIPPS), 1, b
#define SPI1SDIPPS2                      BANKMASK(SPI1SDIPPS), 2, b
#define SPI1SDIPPS3                      BANKMASK(SPI1SDIPPS), 3, b
#define SPI1SDIPPS4                      BANKMASK(SPI1SDIPPS), 4, b
#define SPI1SDOP                         BANKMASK(SPI1CON1), 0, b
#define SPI1SMP                          BANKMASK(SPI1CON1), 7, b
#define SPI1SOSIE                        BANKMASK(SPI1INTE), 5, b
#define SPI1SOSIF                        BANKMASK(SPI1INTF), 5, b
#define SPI1SPIEN                        BANKMASK(SPI1CON0), 7, b
#define SPI1SRMTIE                       BANKMASK(SPI1INTE), 7, b
#define SPI1SRMTIF                       BANKMASK(SPI1INTF), 7, b
#define SPI1SSET                         BANKMASK(SPI1CON2), 2, b
#define SPI1SSFLT                        BANKMASK(SPI1CON2), 6, b
#define SPI1SSP                          BANKMASK(SPI1CON1), 2, b
#define SPI1SSPPS0                       BANKMASK(SPI1SSPPS), 0, b
#define SPI1SSPPS1                       BANKMASK(SPI1SSPPS), 1, b
#define SPI1SSPPS2                       BANKMASK(SPI1SSPPS), 2, b
#define SPI1SSPPS3                       BANKMASK(SPI1SSPPS), 3, b
#define SPI1SSPPS4                       BANKMASK(SPI1SSPPS), 4, b
#define SPI1TCZIE                        BANKMASK(SPI1INTE), 6, b
#define SPI1TCZIF                        BANKMASK(SPI1INTF), 6, b
#define SPI1TXBE                         BANKMASK(SPI1STATUS), 5, b
#define SPI1TXIE                         BANKMASK(PIE7), 1, a
#define SPI1TXIF                         BANKMASK(PIR7), 1, a
#define SPI1TXIP                         BANKMASK(IPR7), 1, a
#define SPI1TXR                          BANKMASK(SPI1CON2), 1, b
#define SPI1TXUIE                        BANKMASK(SPI1INTE), 1, b
#define SPI1TXUIF                        BANKMASK(SPI1INTF), 1, b
#define SPI1TXWE                         BANKMASK(SPI1STATUS), 7, b
#define SPTR0                            BANKMASK(DMAnSPTRL), 0, b
#define SPTR1                            BANKMASK(DMAnSPTRL), 1, b
#define SPTR10                           BANKMASK(DMAnSPTRH), 2, b
#define SPTR11                           BANKMASK(DMAnSPTRH), 3, b
#define SPTR12                           BANKMASK(DMAnSPTRH), 4, b
#define SPTR13                           BANKMASK(DMAnSPTRH), 5, b
#define SPTR14                           BANKMASK(DMAnSPTRH), 6, b
#define SPTR15                           BANKMASK(DMAnSPTRH), 7, b
#define SPTR16                           BANKMASK(DMAnSPTRU), 0, b
#define SPTR17                           BANKMASK(DMAnSPTRU), 1, b
#define SPTR18                           BANKMASK(DMAnSPTRU), 2, b
#define SPTR19                           BANKMASK(DMAnSPTRU), 3, b
#define SPTR2                            BANKMASK(DMAnSPTRL), 2, b
#define SPTR20                           BANKMASK(DMAnSPTRU), 4, b
#define SPTR21                           BANKMASK(DMAnSPTRU), 5, b
#define SPTR3                            BANKMASK(DMAnSPTRL), 3, b
#define SPTR4                            BANKMASK(DMAnSPTRL), 4, b
#define SPTR5                            BANKMASK(DMAnSPTRL), 5, b
#define SPTR6                            BANKMASK(DMAnSPTRL), 6, b
#define SPTR7                            BANKMASK(DMAnSPTRL), 7, b
#define SPTR8                            BANKMASK(DMAnSPTRH), 0, b
#define SPTR9                            BANKMASK(DMAnSPTRH), 1, b
#define SRMTIE                           BANKMASK(SPI1INTE), 7, b
#define SRMTIF                           BANKMASK(SPI1INTF), 7, b
#define SSA0                             BANKMASK(DMAnSSAL), 0, b
#define SSA1                             BANKMASK(DMAnSSAL), 1, b
#define SSA10                            BANKMASK(DMAnSSAH), 2, b
#define SSA11                            BANKMASK(DMAnSSAH), 3, b
#define SSA12                            BANKMASK(DMAnSSAH), 4, b
#define SSA13                            BANKMASK(DMAnSSAH), 5, b
#define SSA14                            BANKMASK(DMAnSSAH), 6, b
#define SSA15                            BANKMASK(DMAnSSAH), 7, b
#define SSA16                            BANKMASK(DMAnSSAU), 0, b
#define SSA17                            BANKMASK(DMAnSSAU), 1, b
#define SSA18                            BANKMASK(DMAnSSAU), 2, b
#define SSA19                            BANKMASK(DMAnSSAU), 3, b
#define SSA2                             BANKMASK(DMAnSSAL), 2, b
#define SSA20                            BANKMASK(DMAnSSAU), 4, b
#define SSA21                            BANKMASK(DMAnSSAU), 5, b
#define SSA3                             BANKMASK(DMAnSSAL), 3, b
#define SSA4                             BANKMASK(DMAnSSAL), 4, b
#define SSA5                             BANKMASK(DMAnSSAL), 5, b
#define SSA6                             BANKMASK(DMAnSSAL), 6, b
#define SSA7                             BANKMASK(DMAnSSAL), 7, b
#define SSA8                             BANKMASK(DMAnSSAH), 0, b
#define SSA9                             BANKMASK(DMAnSSAH), 1, b
#define SSET                             BANKMASK(SPI1CON2), 2, b
#define SSFLT                            BANKMASK(SPI1CON2), 6, b
#define SSP                              BANKMASK(SPI1CON1), 2, b
#define SSTP                             BANKMASK(DMAnCON1), 0, b
#define SSZ0                             BANKMASK(DMAnSSZL), 0, b
#define SSZ1                             BANKMASK(DMAnSSZL), 1, b
#define SSZ10                            BANKMASK(DMAnSSZH), 2, b
#define SSZ11                            BANKMASK(DMAnSSZH), 3, b
#define SSZ2                             BANKMASK(DMAnSSZL), 2, b
#define SSZ3                             BANKMASK(DMAnSSZL), 3, b
#define SSZ4                             BANKMASK(DMAnSSZL), 4, b
#define SSZ5                             BANKMASK(DMAnSSZL), 5, b
#define SSZ6                             BANKMASK(DMAnSSZL), 6, b
#define SSZ7                             BANKMASK(DMAnSSZL), 7, b
#define SSZ8                             BANKMASK(DMAnSSZH), 0, b
#define SSZ9                             BANKMASK(DMAnSSZH), 1, b
#define STAT2                            BANKMASK(ADSTAT), 2, b
#define STATE                            BANKMASK(WDTTMR), 2, b
#define STKOVF                           BANKMASK(PCON0), 7, a
#define STKUNF                           BANKMASK(PCON0), 6, a
#define STPT0                            BANKMASK(ADSTPTL), 0, b
#define STPT1                            BANKMASK(ADSTPTL), 1, b
#define STPT10                           BANKMASK(ADSTPTH), 2, b
#define STPT11                           BANKMASK(ADSTPTH), 3, b
#define STPT12                           BANKMASK(ADSTPTH), 4, b
#define STPT13                           BANKMASK(ADSTPTH), 5, b
#define STPT15                           BANKMASK(ADSTPTH), 6, b
#define STPT16                           BANKMASK(ADSTPTH), 7, b
#define STPT2                            BANKMASK(ADSTPTL), 2, b
#define STPT3                            BANKMASK(ADSTPTL), 3, b
#define STPT4                            BANKMASK(ADSTPTL), 4, b
#define STPT5                            BANKMASK(ADSTPTL), 5, b
#define STPT6                            BANKMASK(ADSTPTL), 6, b
#define STPT7                            BANKMASK(ADSTPTL), 7, b
#define STPT8                            BANKMASK(ADSTPTH), 0, b
#define STPT9                            BANKMASK(ADSTPTH), 1, b
#define STRA                             BANKMASK(CWG1STR), 0, b
#define STRB                             BANKMASK(CWG1STR), 1, b
#define STRC                             BANKMASK(CWG1STR), 2, b
#define STRD                             BANKMASK(CWG1STR), 3, b
#define SWDTEN                           BANKMASK(WDTCON0), 0, b
#define SWIE                             BANKMASK(PIE0), 0, a
#define SWIF                             BANKMASK(PIR0), 0, a
#define SWIP                             BANKMASK(IPR0), 0, a
#define SYSCMD                           BANKMASK(PMD0), 7, b
#define T016BIT                          BANKMASK(T0CON0), 4, b
#define T0ASYNC                          BANKMASK(T0CON1), 4, b
#define T0CKIPPS0                        BANKMASK(T0CKIPPS), 0, b
#define T0CKIPPS1                        BANKMASK(T0CKIPPS), 1, b
#define T0CKIPPS2                        BANKMASK(T0CKIPPS), 2, b
#define T0CKIPPS3                        BANKMASK(T0CKIPPS), 3, b
#define T0CKIPPS4                        BANKMASK(T0CKIPPS), 4, b
#define T0CKPS0                          BANKMASK(T0CON1), 0, b
#define T0CKPS1                          BANKMASK(T0CON1), 1, b
#define T0CKPS2                          BANKMASK(T0CON1), 2, b
#define T0CKPS3                          BANKMASK(T0CON1), 3, b
#define T0CS0                            BANKMASK(T0CON1), 5, b
#define T0CS1                            BANKMASK(T0CON1), 6, b
#define T0CS2                            BANKMASK(T0CON1), 7, b
#define T0EN                             BANKMASK(T0CON0), 7, b
#define T0MD16                           BANKMASK(T0CON0), 4, b
#define T0OUT                            BANKMASK(T0CON0), 5, b
#define T0OUTPS0                         BANKMASK(T0CON0), 0, b
#define T0OUTPS1                         BANKMASK(T0CON0), 1, b
#define T0OUTPS2                         BANKMASK(T0CON0), 2, b
#define T0OUTPS3                         BANKMASK(T0CON0), 3, b
#define T0PR0                            BANKMASK(TMR0H), 0, b
#define T0PR1                            BANKMASK(TMR0H), 1, b
#define T0PR2                            BANKMASK(TMR0H), 2, b
#define T0PR3                            BANKMASK(TMR0H), 3, b
#define T0PR4                            BANKMASK(TMR0H), 4, b
#define T0PR5                            BANKMASK(TMR0H), 5, b
#define T0PR6                            BANKMASK(TMR0H), 6, b
#define T0PR7                            BANKMASK(TMR0H), 7, b
#define T1CKIPPS0                        BANKMASK(T1CKIPPS), 0, b
#define T1CKIPPS1                        BANKMASK(T1CKIPPS), 1, b
#define T1CKIPPS2                        BANKMASK(T1CKIPPS), 2, b
#define T1CKIPPS3                        BANKMASK(T1CKIPPS), 3, b
#define T1CKIPPS4                        BANKMASK(T1CKIPPS), 4, b
#define T1CKPS0                          BANKMASK(T1CON), 4, b
#define T1CKPS1                          BANKMASK(T1CON), 5, b
#define T1CS0                            BANKMASK(T1CLK), 0, b
#define T1CS1                            BANKMASK(T1CLK), 1, b
#define T1CS2                            BANKMASK(T1CLK), 2, b
#define T1CS3                            BANKMASK(T1CLK), 3, b
#define T1GE                             BANKMASK(T1GCON), 7, b
#define T1GGO                            BANKMASK(T1GCON), 3, b
#define T1GGO_NOT_DONE                   BANKMASK(T1GCON), 3, b
#define T1GGO_nDONE                      BANKMASK(T1GCON), 3, b
#define T1GPOL                           BANKMASK(T1GCON), 6, b
#define T1GPPS0                          BANKMASK(T1GPPS), 0, b
#define T1GPPS1                          BANKMASK(T1GPPS), 1, b
#define T1GPPS2                          BANKMASK(T1GPPS), 2, b
#define T1GPPS3                          BANKMASK(T1GPPS), 3, b
#define T1GPPS4                          BANKMASK(T1GPPS), 4, b
#define T1GSPM                           BANKMASK(T1GCON), 4, b
#define T1GSS0                           BANKMASK(T1GATE), 0, b
#define T1GSS1                           BANKMASK(T1GATE), 1, b
#define T1GSS2                           BANKMASK(T1GATE), 2, b
#define T1GSS3                           BANKMASK(T1GATE), 3, b
#define T1GTM                            BANKMASK(T1GCON), 5, b
#define T1GVAL                           BANKMASK(T1GCON), 2, b
#define T1RD16                           BANKMASK(T1CON), 1, b
#define T2CKPOL                          BANKMASK(T2HLT), 6, b
#define T2CKPS0                          BANKMASK(T2CON), 4, b
#define T2CKPS1                          BANKMASK(T2CON), 5, b
#define T2CKPS2                          BANKMASK(T2CON), 6, b
#define T2CKSYNC                         BANKMASK(T2HLT), 5, b
#define T2CS0                            BANKMASK(T2CLKCON), 0, b
#define T2CS1                            BANKMASK(T2CLKCON), 1, b
#define T2CS2                            BANKMASK(T2CLKCON), 2, b
#define T2CS3                            BANKMASK(T2CLKCON), 3, b
#define T2INPPS0                         BANKMASK(T2INPPS), 0, b
#define T2INPPS1                         BANKMASK(T2INPPS), 1, b
#define T2INPPS2                         BANKMASK(T2INPPS), 2, b
#define T2INPPS3                         BANKMASK(T2INPPS), 3, b
#define T2INPPS4                         BANKMASK(T2INPPS), 4, b
#define T2MODE0                          BANKMASK(T2HLT), 0, b
#define T2MODE1                          BANKMASK(T2HLT), 1, b
#define T2MODE2                          BANKMASK(T2HLT), 2, b
#define T2MODE3                          BANKMASK(T2HLT), 3, b
#define T2MODE4                          BANKMASK(T2HLT), 4, b
#define T2ON                             BANKMASK(T2CON), 7, b
#define T2OUTPS0                         BANKMASK(T2CON), 0, b
#define T2OUTPS1                         BANKMASK(T2CON), 1, b
#define T2OUTPS2                         BANKMASK(T2CON), 2, b
#define T2OUTPS3                         BANKMASK(T2CON), 3, b
#define T2PSYNC                          BANKMASK(T2HLT), 7, b
#define T2RSEL0                          BANKMASK(T2RST), 0, b
#define T2RSEL1                          BANKMASK(T2RST), 1, b
#define T2RSEL2                          BANKMASK(T2RST), 2, b
#define T2RSEL3                          BANKMASK(T2RST), 3, b
#define T2RSEL4                          BANKMASK(T2RST), 4, b
#define T4CKPOL                          BANKMASK(T4HLT), 6, b
#define T4CKPS0                          BANKMASK(T4CON), 4, b
#define T4CKPS1                          BANKMASK(T4CON), 5, b
#define T4CKPS2                          BANKMASK(T4CON), 6, b
#define T4CKSYNC                         BANKMASK(T4HLT), 5, b
#define T4CS0                            BANKMASK(T4CLKCON), 0, b
#define T4CS1                            BANKMASK(T4CLKCON), 1, b
#define T4CS2                            BANKMASK(T4CLKCON), 2, b
#define T4CS3                            BANKMASK(T4CLKCON), 3, b
#define T4INPPS0                         BANKMASK(T4INPPS), 0, b
#define T4INPPS1                         BANKMASK(T4INPPS), 1, b
#define T4INPPS2                         BANKMASK(T4INPPS), 2, b
#define T4INPPS3                         BANKMASK(T4INPPS), 3, b
#define T4INPPS4                         BANKMASK(T4INPPS), 4, b
#define T4MODE0                          BANKMASK(T4HLT), 0, b
#define T4MODE1                          BANKMASK(T4HLT), 1, b
#define T4MODE2                          BANKMASK(T4HLT), 2, b
#define T4MODE3                          BANKMASK(T4HLT), 3, b
#define T4MODE4                          BANKMASK(T4HLT), 4, b
#define T4ON                             BANKMASK(T4CON), 7, b
#define T4OUTPS0                         BANKMASK(T4CON), 0, b
#define T4OUTPS1                         BANKMASK(T4CON), 1, b
#define T4OUTPS2                         BANKMASK(T4CON), 2, b
#define T4OUTPS3                         BANKMASK(T4CON), 3, b
#define T4PSYNC                          BANKMASK(T4HLT), 7, b
#define T4RSEL0                          BANKMASK(T4RST), 0, b
#define T4RSEL1                          BANKMASK(T4RST), 1, b
#define T4RSEL2                          BANKMASK(T4RST), 2, b
#define T4RSEL3                          BANKMASK(T4RST), 3, b
#define T4RSEL4                          BANKMASK(T4RST), 4, b
#define TCOMPIE                          BANKMASK(I3C1PIE1), 7, b
#define TCOMPIF                          BANKMASK(I3C1PIR1), 7, b
#define TCZIE                            BANKMASK(SPI1INTE), 6, b
#define TCZIF                            BANKMASK(SPI1INTF), 6, b
#define TE0ERR                           BANKMASK(I3C1BSTAT), 0, b
#define TE1ERR                           BANKMASK(I3C1BSTAT), 1, b
#define TE2ERR                           BANKMASK(I3C1BSTAT), 2, b
#define TE3ERR                           BANKMASK(I3C1BSTAT), 3, b
#define TE4ERR                           BANKMASK(I3C1BSTAT), 4, b
#define TE5ERR                           BANKMASK(I3C1BSTAT), 5, b
#define TE6ERR                           BANKMASK(I3C1BSTAT), 6, b
#define TMD0                             BANKMASK(ADCON3), 0, b
#define TMD1                             BANKMASK(ADCON3), 1, b
#define TMD2                             BANKMASK(ADCON3), 2, b
#define TMR0H0                           BANKMASK(TMR0H), 0, b
#define TMR0H1                           BANKMASK(TMR0H), 1, b
#define TMR0H2                           BANKMASK(TMR0H), 2, b
#define TMR0H3                           BANKMASK(TMR0H), 3, b
#define TMR0H4                           BANKMASK(TMR0H), 4, b
#define TMR0H5                           BANKMASK(TMR0H), 5, b
#define TMR0H6                           BANKMASK(TMR0H), 6, b
#define TMR0H7                           BANKMASK(TMR0H), 7, b
#define TMR0IE                           BANKMASK(PIE3), 5, a
#define TMR0IF                           BANKMASK(PIR3), 5, a
#define TMR0IP                           BANKMASK(IPR3), 5, a
#define TMR0L0                           BANKMASK(TMR0L), 0, b
#define TMR0L1                           BANKMASK(TMR0L), 1, b
#define TMR0L2                           BANKMASK(TMR0L), 2, b
#define TMR0L3                           BANKMASK(TMR0L), 3, b
#define TMR0L4                           BANKMASK(TMR0L), 4, b
#define TMR0L5                           BANKMASK(TMR0L), 5, b
#define TMR0L6                           BANKMASK(TMR0L), 6, b
#define TMR0L7                           BANKMASK(TMR0L), 7, b
#define TMR0MD                           BANKMASK(PMD1), 4, b
#define TMR10                            BANKMASK(TMR1L), 0, b
#define TMR11                            BANKMASK(TMR1L), 1, b
#define TMR110                           BANKMASK(TMR1H), 2, b
#define TMR111                           BANKMASK(TMR1H), 3, b
#define TMR112                           BANKMASK(TMR1H), 4, b
#define TMR113                           BANKMASK(TMR1H), 5, b
#define TMR114                           BANKMASK(TMR1H), 6, b
#define TMR115                           BANKMASK(TMR1H), 7, b
#define TMR12                            BANKMASK(TMR1L), 2, b
#define TMR13                            BANKMASK(TMR1L), 3, b
#define TMR14                            BANKMASK(TMR1L), 4, b
#define TMR15                            BANKMASK(TMR1L), 5, b
#define TMR16                            BANKMASK(TMR1L), 6, b
#define TMR17                            BANKMASK(TMR1L), 7, b
#define TMR18                            BANKMASK(TMR1H), 0, b
#define TMR19                            BANKMASK(TMR1H), 1, b
#define TMR1GIE                          BANKMASK(PIE3), 7, a
#define TMR1GIF                          BANKMASK(PIR3), 7, a
#define TMR1GIP                          BANKMASK(IPR3), 7, a
#define TMR1H0                           BANKMASK(TMR1H), 0, b
#define TMR1H1                           BANKMASK(TMR1H), 1, b
#define TMR1H2                           BANKMASK(TMR1H), 2, b
#define TMR1H3                           BANKMASK(TMR1H), 3, b
#define TMR1H4                           BANKMASK(TMR1H), 4, b
#define TMR1H5                           BANKMASK(TMR1H), 5, b
#define TMR1H6                           BANKMASK(TMR1H), 6, b
#define TMR1H7                           BANKMASK(TMR1H), 7, b
#define TMR1IE                           BANKMASK(PIE3), 6, a
#define TMR1IF                           BANKMASK(PIR3), 6, a
#define TMR1IP                           BANKMASK(IPR3), 6, a
#define TMR1L0                           BANKMASK(TMR1L), 0, b
#define TMR1L1                           BANKMASK(TMR1L), 1, b
#define TMR1L2                           BANKMASK(TMR1L), 2, b
#define TMR1L3                           BANKMASK(TMR1L), 3, b
#define TMR1L4                           BANKMASK(TMR1L), 4, b
#define TMR1L5                           BANKMASK(TMR1L), 5, b
#define TMR1L6                           BANKMASK(TMR1L), 6, b
#define TMR1L7                           BANKMASK(TMR1L), 7, b
#define TMR1MD                           BANKMASK(PMD1), 5, b
#define TMR1ON                           BANKMASK(T1CON), 0, b
#define TMR2IE                           BANKMASK(PIE4), 0, a
#define TMR2IF                           BANKMASK(PIR4), 0, a
#define TMR2IP                           BANKMASK(IPR4), 0, a
#define TMR2MD                           BANKMASK(PMD1), 6, b
#define TMR2ON                           BANKMASK(T2CON), 7, b
#define TMR4IE                           BANKMASK(PIE4), 1, a
#define TMR4IF                           BANKMASK(PIR4), 1, a
#define TMR4IP                           BANKMASK(IPR4), 1, a
#define TMR4MD                           BANKMASK(PMD1), 7, b
#define TMR4ON                           BANKMASK(T4CON), 7, b
#define TMRAOSEN                         BANKMASK(TU16ACON1), 6, b
#define TMRBOSEN                         BANKMASK(TU16BCON1), 6, b
