garyPenhook/PIC-Assembler/device_includes/pic18f05q20.inc
#define TOBY32                           BANKMASK(I2C1BTO), 6, b
#define TOREC                            BANKMASK(I2C1BTO), 7, b
#define TOTIME0                          BANKMASK(I2C1BTO), 0, b
#define TOTIME1                          BANKMASK(I2C1BTO), 1, b
#define TOTIME2                          BANKMASK(I2C1BTO), 2, b
#define TOTIME3                          BANKMASK(I2C1BTO), 3, b
#define TOTIME4                          BANKMASK(I2C1BTO), 4, b
#define TOTIME5                          BANKMASK(I2C1BTO), 5, b
#define TRIGEN                           BANKMASK(SCANCON0), 6, b
#define TRISA0                           BANKMASK(TRISA), 0, a
#define TRISA1                           BANKMASK(TRISA), 1, a
#define TRISA2                           BANKMASK(TRISA), 2, a
#define TRISA4                           BANKMASK(TRISA), 4, a
#define TRISA5                           BANKMASK(TRISA), 5, a
#define TRISC0                           BANKMASK(TRISC), 0, a
#define TRISC1                           BANKMASK(TRISC), 1, a
#define TRISC3                           BANKMASK(TRISC), 3, a
#define TRISC4                           BANKMASK(TRISC), 4, a
#define TRISC5                           BANKMASK(TRISC), 5, a
#define TRISC6                           BANKMASK(TRISC), 6, a
#define TRISC7                           BANKMASK(TRISC), 7, a
#define TSEL0                            BANKMASK(SCANTRIG), 0, b
#define TSEL1                            BANKMASK(SCANTRIG), 1, b
#define TSEL2                            BANKMASK(SCANTRIG), 2, b
#define TSEL3                            BANKMASK(SCANTRIG), 3, b
#define TSEN                             BANKMASK(FVRCON), 5, b
#define TSRNG                            BANKMASK(FVRCON), 4, b
#define TU16ACAPT                        BANKMASK(TU16ACON1), 3, b
#define TU16ACIE                         BANKMASK(TU16ACON0), 0, b
#define TU16ACIF                         BANKMASK(TU16ACON1), 0, b
#define TU16ACLK0                        BANKMASK(TU16ACLK), 0, b
#define TU16ACLK1                        BANKMASK(TU16ACLK), 1, b
#define TU16ACLK2                        BANKMASK(TU16ACLK), 2, b
#define TU16ACLK3                        BANKMASK(TU16ACLK), 3, b
#define TU16ACLK4                        BANKMASK(TU16ACLK), 4, b
#define TU16ACLR                         BANKMASK(TU16ACON1), 5, b
#define TU16ACPOL                        BANKMASK(TU16ACON0), 6, b
#define TU16ACR0                         BANKMASK(TU16ACRL), 0, b
#define TU16ACR1                         BANKMASK(TU16ACRL), 1, b
#define TU16ACR10                        BANKMASK(TU16ACRH), 2, b
#define TU16ACR11                        BANKMASK(TU16ACRH), 3, b
#define TU16ACR12                        BANKMASK(TU16ACRH), 4, b
#define TU16ACR13                        BANKMASK(TU16ACRH), 5, b
#define TU16ACR14                        BANKMASK(TU16ACRH), 6, b
#define TU16ACR15                        BANKMASK(TU16ACRH), 7, b
#define TU16ACR2                         BANKMASK(TU16ACRL), 2, b
#define TU16ACR24                        BANKMASK(TU16ACRT), 0, b
#define TU16ACR25                        BANKMASK(TU16ACRT), 1, b
#define TU16ACR26                        BANKMASK(TU16ACRT), 2, b
#define TU16ACR27                        BANKMASK(TU16ACRT), 3, b
#define TU16ACR28                        BANKMASK(TU16ACRT), 4, b
#define TU16ACR29                        BANKMASK(TU16ACRT), 5, b
#define TU16ACR3                         BANKMASK(TU16ACRL), 3, b
#define TU16ACR30                        BANKMASK(TU16ACRT), 6, b
#define TU16ACR31                        BANKMASK(TU16ACRT), 7, b
#define TU16ACR4                         BANKMASK(TU16ACRL), 4, b
#define TU16ACR5                         BANKMASK(TU16ACRL), 5, b
#define TU16ACR6                         BANKMASK(TU16ACRL), 6, b
#define TU16ACR7                         BANKMASK(TU16ACRL), 7, b
#define TU16ACR8                         BANKMASK(TU16ACRH), 0, b
#define TU16ACR9                         BANKMASK(TU16ACRH), 1, b
#define TU16ACRH0                        BANKMASK(TU16ACRH), 0, b
#define TU16ACRH1                        BANKMASK(TU16ACRH), 1, b
#define TU16ACRH2                        BANKMASK(TU16ACRH), 2, b
#define TU16ACRH3                        BANKMASK(TU16ACRH), 3, b
#define TU16ACRH4                        BANKMASK(TU16ACRH), 4, b
#define TU16ACRH5                        BANKMASK(TU16ACRH), 5, b
#define TU16ACRH6                        BANKMASK(TU16ACRH), 6, b
#define TU16ACRH7                        BANKMASK(TU16ACRH), 7, b
#define TU16ACRL0                        BANKMASK(TU16ACRL), 0, b
#define TU16ACRL1                        BANKMASK(TU16ACRL), 1, b
#define TU16ACRL2                        BANKMASK(TU16ACRL), 2, b
#define TU16ACRL3                        BANKMASK(TU16ACRL), 3, b
#define TU16ACRL4                        BANKMASK(TU16ACRL), 4, b
#define TU16ACRL5                        BANKMASK(TU16ACRL), 5, b
#define TU16ACRL6                        BANKMASK(TU16ACRL), 6, b
#define TU16ACRL7                        BANKMASK(TU16ACRL), 7, b
#define TU16ACRT0                        BANKMASK(TU16ACRT), 0, b
#define TU16ACRT1                        BANKMASK(TU16ACRT), 1, b
#define TU16ACRT2                        BANKMASK(TU16ACRT), 2, b
#define TU16ACRT3                        BANKMASK(TU16ACRT), 3, b
#define TU16ACRT4                        BANKMASK(TU16ACRT), 4, b
#define TU16ACRT5                        BANKMASK(TU16ACRT), 5, b
#define TU16ACRT6                        BANKMASK(TU16ACRT), 6, b
#define TU16ACRT7                        BANKMASK(TU16ACRT), 7, b
#define TU16ACSYNC                       BANKMASK(TU16AHLT), 6, b
#define TU16AEPOL                        BANKMASK(TU16AHLT), 7, b
#define TU16AERS0                        BANKMASK(TU16AERS), 0, b
#define TU16AERS1                        BANKMASK(TU16AERS), 1, b
#define TU16AERS2                        BANKMASK(TU16AERS), 2, b
#define TU16AERS3                        BANKMASK(TU16AERS), 3, b
#define TU16AERS4                        BANKMASK(TU16AERS), 4, b
#define TU16AERS5                        BANKMASK(TU16AERS), 5, b
#define TU16AIE                          BANKMASK(PIE4), 2, a
#define TU16AIF                          BANKMASK(PIR4), 2, a
#define TU16AIP                          BANKMASK(IPR4), 2, a
#define TU16ALIMIT                       BANKMASK(TU16ACON1), 4, b
#define TU16AMD                          BANKMASK(PMD2), 0, b
#define TU16AOM                          BANKMASK(TU16ACON0), 5, b
#define TU16AON                          BANKMASK(TU16ACON0), 7, b
#define TU16AOPOL                        BANKMASK(TU16ACON0), 4, b
#define TU16APR0                         BANKMASK(TU16APRL), 0, b
#define TU16APR1                         BANKMASK(TU16APRL), 1, b
#define TU16APR10                        BANKMASK(TU16APRH), 2, b
#define TU16APR11                        BANKMASK(TU16APRH), 3, b
#define TU16APR12                        BANKMASK(TU16APRH), 4, b
#define TU16APR13                        BANKMASK(TU16APRH), 5, b
#define TU16APR14                        BANKMASK(TU16APRH), 6, b
#define TU16APR15                        BANKMASK(TU16APRH), 7, b
#define TU16APR2                         BANKMASK(TU16APRL), 2, b
#define TU16APR24                        BANKMASK(TU16APRT), 0, b
#define TU16APR25                        BANKMASK(TU16APRT), 1, b
#define TU16APR26                        BANKMASK(TU16APRT), 2, b
#define TU16APR27                        BANKMASK(TU16APRT), 3, b
#define TU16APR28                        BANKMASK(TU16APRT), 4, b
#define TU16APR29                        BANKMASK(TU16APRT), 5, b
#define TU16APR3                         BANKMASK(TU16APRL), 3, b
#define TU16APR30                        BANKMASK(TU16APRT), 6, b
#define TU16APR31                        BANKMASK(TU16APRT), 7, b
#define TU16APR4                         BANKMASK(TU16APRL), 4, b
#define TU16APR5                         BANKMASK(TU16APRL), 5, b
#define TU16APR6                         BANKMASK(TU16APRL), 6, b
#define TU16APR7                         BANKMASK(TU16APRL), 7, b
#define TU16APR8                         BANKMASK(TU16APRH), 0, b
#define TU16APR9                         BANKMASK(TU16APRH), 1, b
#define TU16APRH0                        BANKMASK(TU16APRH), 0, b
#define TU16APRH1                        BANKMASK(TU16APRH), 1, b
#define TU16APRH2                        BANKMASK(TU16APRH), 2, b
#define TU16APRH3                        BANKMASK(TU16APRH), 3, b
#define TU16APRH4                        BANKMASK(TU16APRH), 4, b
#define TU16APRH5                        BANKMASK(TU16APRH), 5, b
#define TU16APRH6                        BANKMASK(TU16APRH), 6, b
#define TU16APRH7                        BANKMASK(TU16APRH), 7, b
#define TU16APRIE                        BANKMASK(TU16ACON0), 2, b
#define TU16APRIF                        BANKMASK(TU16ACON1), 2, b
#define TU16APRL0                        BANKMASK(TU16APRL), 0, b
#define TU16APRL1                        BANKMASK(TU16APRL), 1, b
#define TU16APRL2                        BANKMASK(TU16APRL), 2, b
#define TU16APRL3                        BANKMASK(TU16APRL), 3, b
#define TU16APRL4                        BANKMASK(TU16APRL), 4, b
#define TU16APRL5                        BANKMASK(TU16APRL), 5, b
#define TU16APRL6                        BANKMASK(TU16APRL), 6, b
#define TU16APRL7                        BANKMASK(TU16APRL), 7, b
#define TU16APRT0                        BANKMASK(TU16APRT), 0, b
#define TU16APRT1                        BANKMASK(TU16APRT), 1, b
#define TU16APRT2                        BANKMASK(TU16APRT), 2, b
#define TU16APRT3                        BANKMASK(TU16APRT), 3, b
#define TU16APRT4                        BANKMASK(TU16APRT), 4, b
#define TU16APRT5                        BANKMASK(TU16APRT), 5, b
#define TU16APRT6                        BANKMASK(TU16APRT), 6, b
#define TU16APRT7                        BANKMASK(TU16APRT), 7, b
#define TU16APS0                         BANKMASK(TU16APS), 0, b
#define TU16APS1                         BANKMASK(TU16APS), 1, b
#define TU16APS2                         BANKMASK(TU16APS), 2, b
#define TU16APS3                         BANKMASK(TU16APS), 3, b
#define TU16APS4                         BANKMASK(TU16APS), 4, b
#define TU16APS5                         BANKMASK(TU16APS), 5, b
#define TU16APS6                         BANKMASK(TU16APS), 6, b
#define TU16APS7                         BANKMASK(TU16APS), 7, b
#define TU16ARDSEL                       BANKMASK(TU16ACON0), 3, b
#define TU16ARESET0                      BANKMASK(TU16AHLT), 2, b
#define TU16ARESET1                      BANKMASK(TU16AHLT), 3, b
#define TU16ARUN                         BANKMASK(TU16ACON1), 7, b
#define TU16ASTART0                      BANKMASK(TU16AHLT), 4, b
#define TU16ASTART1                      BANKMASK(TU16AHLT), 5, b
#define TU16ASTOP0                       BANKMASK(TU16AHLT), 0, b
#define TU16ASTOP1                       BANKMASK(TU16AHLT), 1, b
#define TU16ATMR0                        BANKMASK(TU16ATMRL), 0, b
#define TU16ATMR1                        BANKMASK(TU16ATMRL), 1, b
#define TU16ATMR10                       BANKMASK(TU16ATMRH), 2, b
#define TU16ATMR11                       BANKMASK(TU16ATMRH), 3, b
#define TU16ATMR12                       BANKMASK(TU16ATMRH), 4, b
#define TU16ATMR13                       BANKMASK(TU16ATMRH), 5, b
#define TU16ATMR14                       BANKMASK(TU16ATMRH), 6, b
#define TU16ATMR15                       BANKMASK(TU16ATMRH), 7, b
#define TU16ATMR2                        BANKMASK(TU16ATMRL), 2, b
#define TU16ATMR24                       BANKMASK(TU16ATMRT), 0, b
#define TU16ATMR25                       BANKMASK(TU16ATMRT), 1, b
#define TU16ATMR26                       BANKMASK(TU16ATMRT), 2, b
#define TU16ATMR27                       BANKMASK(TU16ATMRT), 3, b
#define TU16ATMR28                       BANKMASK(TU16ATMRT), 4, b
#define TU16ATMR29                       BANKMASK(TU16ATMRT), 5, b
#define TU16ATMR3                        BANKMASK(TU16ATMRL), 3, b
#define TU16ATMR30                       BANKMASK(TU16ATMRT), 6, b
#define TU16ATMR31                       BANKMASK(TU16ATMRT), 7, b
#define TU16ATMR4                        BANKMASK(TU16ATMRL), 4, b
#define TU16ATMR5                        BANKMASK(TU16ATMRL), 5, b
#define TU16ATMR6                        BANKMASK(TU16ATMRL), 6, b
#define TU16ATMR7                        BANKMASK(TU16ATMRL), 7, b
#define TU16ATMR8                        BANKMASK(TU16ATMRH), 0, b
#define TU16ATMR9                        BANKMASK(TU16ATMRH), 1, b
#define TU16ATMRH0                       BANKMASK(TU16ATMRH), 0, b
#define TU16ATMRH1                       BANKMASK(TU16ATMRH), 1, b
#define TU16ATMRH2                       BANKMASK(TU16ATMRH), 2, b
#define TU16ATMRH3                       BANKMASK(TU16ATMRH), 3, b
#define TU16ATMRH4                       BANKMASK(TU16ATMRH), 4, b
#define TU16ATMRH5                       BANKMASK(TU16ATMRH), 5, b
#define TU16ATMRH6                       BANKMASK(TU16ATMRH), 6, b
#define TU16ATMRH7                       BANKMASK(TU16ATMRH), 7, b
#define TU16ATMRL0                       BANKMASK(TU16ATMRL), 0, b
#define TU16ATMRL1                       BANKMASK(TU16ATMRL), 1, b
#define TU16ATMRL2                       BANKMASK(TU16ATMRL), 2, b
#define TU16ATMRL3                       BANKMASK(TU16ATMRL), 3, b
#define TU16ATMRL4                       BANKMASK(TU16ATMRL), 4, b
#define TU16ATMRL5                       BANKMASK(TU16ATMRL), 5, b
#define TU16ATMRL6                       BANKMASK(TU16ATMRL), 6, b
#define TU16ATMRL7                       BANKMASK(TU16ATMRL), 7, b
#define TU16ATMRT0                       BANKMASK(TU16ATMRT), 0, b
#define TU16ATMRT1                       BANKMASK(TU16ATMRT), 1, b
#define TU16ATMRT2                       BANKMASK(TU16ATMRT), 2, b
#define TU16ATMRT3                       BANKMASK(TU16ATMRT), 3, b
#define TU16ATMRT4                       BANKMASK(TU16ATMRT), 4, b
#define TU16ATMRT5                       BANKMASK(TU16ATMRT), 5, b
#define TU16ATMRT6                       BANKMASK(TU16ATMRT), 6, b
#define TU16ATMRT7                       BANKMASK(TU16ATMRT), 7, b
#define TU16AZIE                         BANKMASK(TU16ACON0), 1, b
#define TU16AZIF                         BANKMASK(TU16ACON1), 1, b
#define TU16BCAPT                        BANKMASK(TU16BCON1), 3, b
#define TU16BCIE                         BANKMASK(TU16BCON0), 0, b
#define TU16BCIF                         BANKMASK(TU16BCON1), 0, b
#define TU16BCLK0                        BANKMASK(TU16BCLK), 0, b
#define TU16BCLK1                        BANKMASK(TU16BCLK), 1, b
#define TU16BCLK2                        BANKMASK(TU16BCLK), 2, b
#define TU16BCLK3                        BANKMASK(TU16BCLK), 3, b
#define TU16BCLK4                        BANKMASK(TU16BCLK), 4, b
#define TU16BCLR                         BANKMASK(TU16BCON1), 5, b
#define TU16BCPOL                        BANKMASK(TU16BCON0), 6, b
#define TU16BCR0                         BANKMASK(TU16BCRL), 0, b
#define TU16BCR1                         BANKMASK(TU16BCRL), 1, b
#define TU16BCR10                        BANKMASK(TU16BCRH), 2, b
#define TU16BCR11                        BANKMASK(TU16BCRH), 3, b
#define TU16BCR12                        BANKMASK(TU16BCRH), 4, b
#define TU16BCR13                        BANKMASK(TU16BCRH), 5, b
#define TU16BCR14                        BANKMASK(TU16BCRH), 6, b
#define TU16BCR15                        BANKMASK(TU16BCRH), 7, b
#define TU16BCR2                         BANKMASK(TU16BCRL), 2, b
#define TU16BCR24                        BANKMASK(TU16BCRT), 0, b
#define TU16BCR25                        BANKMASK(TU16BCRT), 1, b
#define TU16BCR26                        BANKMASK(TU16BCRT), 2, b
#define TU16BCR27                        BANKMASK(TU16BCRT), 3, b
#define TU16BCR28                        BANKMASK(TU16BCRT), 4, b
#define TU16BCR29                        BANKMASK(TU16BCRT), 5, b
#define TU16BCR3                         BANKMASK(TU16BCRL), 3, b
#define TU16BCR30                        BANKMASK(TU16BCRT), 6, b
#define TU16BCR31                        BANKMASK(TU16BCRT), 7, b
#define TU16BCR4                         BANKMASK(TU16BCRL), 4, b
#define TU16BCR5                         BANKMASK(TU16BCRL), 5, b
#define TU16BCR6                         BANKMASK(TU16BCRL), 6, b
#define TU16BCR7                         BANKMASK(TU16BCRL), 7, b
#define TU16BCR8                         BANKMASK(TU16BCRH), 0, b
#define TU16BCR9                         BANKMASK(TU16BCRH), 1, b
#define TU16BCRH0                        BANKMASK(TU16BCRH), 0, b
#define TU16BCRH1                        BANKMASK(TU16BCRH), 1, b
#define TU16BCRH2                        BANKMASK(TU16BCRH), 2, b
#define TU16BCRH3                        BANKMASK(TU16BCRH), 3, b
#define TU16BCRH4                        BANKMASK(TU16BCRH), 4, b
#define TU16BCRH5                        BANKMASK(TU16BCRH), 5, b
#define TU16BCRH6                        BANKMASK(TU16BCRH), 6, b
#define TU16BCRH7                        BANKMASK(TU16BCRH), 7, b
#define TU16BCRL0                        BANKMASK(TU16BCRL), 0, b
#define TU16BCRL1                        BANKMASK(TU16BCRL), 1, b
#define TU16BCRL2                        BANKMASK(TU16BCRL), 2, b
#define TU16BCRL3                        BANKMASK(TU16BCRL), 3, b
#define TU16BCRL4                        BANKMASK(TU16BCRL), 4, b
#define TU16BCRL5                        BANKMASK(TU16BCRL), 5, b
#define TU16BCRL6                        BANKMASK(TU16BCRL), 6, b
#define TU16BCRL7                        BANKMASK(TU16BCRL), 7, b
#define TU16BCRT0                        BANKMASK(TU16BCRT), 0, b
#define TU16BCRT1                        BANKMASK(TU16BCRT), 1, b
#define TU16BCRT2                        BANKMASK(TU16BCRT), 2, b
#define TU16BCRT3                        BANKMASK(TU16BCRT), 3, b
#define TU16BCRT4                        BANKMASK(TU16BCRT), 4, b
#define TU16BCRT5                        BANKMASK(TU16BCRT), 5, b
#define TU16BCRT6                        BANKMASK(TU16BCRT), 6, b
#define TU16BCRT7                        BANKMASK(TU16BCRT), 7, b
#define TU16BCSYNC                       BANKMASK(TU16BHLT), 6, b
#define TU16BEPOL                        BANKMASK(TU16BHLT), 7, b
#define TU16BERS0                        BANKMASK(TU16BERS), 0, b
#define TU16BERS1                        BANKMASK(TU16BERS), 1, b
#define TU16BERS2                        BANKMASK(TU16BERS), 2, b
#define TU16BERS3                        BANKMASK(TU16BERS), 3, b
#define TU16BERS4                        BANKMASK(TU16BERS), 4, b
#define TU16BERS5                        BANKMASK(TU16BERS), 5, b
#define TU16BIE                          BANKMASK(PIE4), 3, a
#define TU16BIF                          BANKMASK(PIR4), 3, a
#define TU16BIP                          BANKMASK(IPR4), 3, a
#define TU16BLIMIT                       BANKMASK(TU16BCON1), 4, b
#define TU16BMD                          BANKMASK(PMD2), 1, b
#define TU16BOM                          BANKMASK(TU16BCON0), 5, b
#define TU16BON                          BANKMASK(TU16BCON0), 7, b
#define TU16BOPOL                        BANKMASK(TU16BCON0), 4, b
#define TU16BPR0                         BANKMASK(TU16BPRL), 0, b
#define TU16BPR1                         BANKMASK(TU16BPRL), 1, b
#define TU16BPR10                        BANKMASK(TU16BPRH), 2, b
#define TU16BPR11                        BANKMASK(TU16BPRH), 3, b
#define TU16BPR12                        BANKMASK(TU16BPRH), 4, b
#define TU16BPR13                        BANKMASK(TU16BPRH), 5, b
#define TU16BPR14                        BANKMASK(TU16BPRH), 6, b
#define TU16BPR15                        BANKMASK(TU16BPRH), 7, b
#define TU16BPR2                         BANKMASK(TU16BPRL), 2, b
#define TU16BPR24                        BANKMASK(TU16BPRT), 0, b
#define TU16BPR25                        BANKMASK(TU16BPRT), 1, b
#define TU16BPR26                        BANKMASK(TU16BPRT), 2, b
#define TU16BPR27                        BANKMASK(TU16BPRT), 3, b
#define TU16BPR28                        BANKMASK(TU16BPRT), 4, b
#define TU16BPR29                        BANKMASK(TU16BPRT), 5, b
#define TU16BPR3                         BANKMASK(TU16BPRL), 3, b
#define TU16BPR30                        BANKMASK(TU16BPRT), 6, b
#define TU16BPR31                        BANKMASK(TU16BPRT), 7, b
#define TU16BPR4                         BANKMASK(TU16BPRL), 4, b
#define TU16BPR5                         BANKMASK(TU16BPRL), 5, b
#define TU16BPR6                         BANKMASK(TU16BPRL), 6, b
#define TU16BPR7                         BANKMASK(TU16BPRL), 7, b
#define TU16BPR8                         BANKMASK(TU16BPRH), 0, b
#define TU16BPR9                         BANKMASK(TU16BPRH), 1, b
#define TU16BPRH0                        BANKMASK(TU16BPRH), 0, b
#define TU16BPRH1                        BANKMASK(TU16BPRH), 1, b
#define TU16BPRH2                        BANKMASK(TU16BPRH), 2, b
#define TU16BPRH3                        BANKMASK(TU16BPRH), 3, b
#define TU16BPRH4                        BANKMASK(TU16BPRH), 4, b
#define TU16BPRH5                        BANKMASK(TU16BPRH), 5, b
#define TU16BPRH6                        BANKMASK(TU16BPRH), 6, b
#define TU16BPRH7                        BANKMASK(TU16BPRH), 7, b
#define TU16BPRIE                        BANKMASK(TU16BCON0), 2, b
#define TU16BPRIF                        BANKMASK(TU16BCON1), 2, b
#define TU16BPRL0                        BANKMASK(TU16BPRL), 0, b
#define TU16BPRL1                        BANKMASK(TU16BPRL), 1, b
#define TU16BPRL2                        BANKMASK(TU16BPRL), 2, b
#define TU16BPRL3                        BANKMASK(TU16BPRL), 3, b
#define TU16BPRL4                        BANKMASK(TU16BPRL), 4, b
#define TU16BPRL5                        BANKMASK(TU16BPRL), 5, b
#define TU16BPRL6                        BANKMASK(TU16BPRL), 6, b
#define TU16BPRL7                        BANKMASK(TU16BPRL), 7, b
#define TU16BPRT0                        BANKMASK(TU16BPRT), 0, b
#define TU16BPRT1                        BANKMASK(TU16BPRT), 1, b
#define TU16BPRT2                        BANKMASK(TU16BPRT), 2, b
#define TU16BPRT3                        BANKMASK(TU16BPRT), 3, b
#define TU16BPRT4                        BANKMASK(TU16BPRT), 4, b
#define TU16BPRT5                        BANKMASK(TU16BPRT), 5, b
#define TU16BPRT6                        BANKMASK(TU16BPRT), 6, b
#define TU16BPRT7                        BANKMASK(TU16BPRT), 7, b
#define TU16BPS0                         BANKMASK(TU16BPS), 0, b
#define TU16BPS1                         BANKMASK(TU16BPS), 1, b
#define TU16BPS2                         BANKMASK(TU16BPS), 2, b
#define TU16BPS3                         BANKMASK(TU16BPS), 3, b
#define TU16BPS4                         BANKMASK(TU16BPS), 4, b
#define TU16BPS5                         BANKMASK(TU16BPS), 5, b
#define TU16BPS6                         BANKMASK(TU16BPS), 6, b
#define TU16BPS7                         BANKMASK(TU16BPS), 7, b
#define TU16BRDSEL                       BANKMASK(TU16BCON0), 3, b
#define TU16BRESET0                      BANKMASK(TU16BHLT), 2, b
#define TU16BRESET1                      BANKMASK(TU16BHLT), 3, b
#define TU16BRUN                         BANKMASK(TU16BCON1), 7, b
#define TU16BSTART0                      BANKMASK(TU16BHLT), 4, b
#define TU16BSTART1                      BANKMASK(TU16BHLT), 5, b
#define TU16BSTOP0                       BANKMASK(TU16BHLT), 0, b
#define TU16BSTOP1                       BANKMASK(TU16BHLT), 1, b
#define TU16BTMR0                        BANKMASK(TU16BTMRL), 0, b
#define TU16BTMR1                        BANKMASK(TU16BTMRL), 1, b
#define TU16BTMR10                       BANKMASK(TU16BTMRH), 2, b
#define TU16BTMR11                       BANKMASK(TU16BTMRH), 3, b
#define TU16BTMR12                       BANKMASK(TU16BTMRH), 4, b
#define TU16BTMR13                       BANKMASK(TU16BTMRH), 5, b
